Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xa2 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xd75aa): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x9687f): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa7272): /home/saveasmtz/Documents/embedded/stepper_board_firmware/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x122d7): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x64380): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)

    <b2>   DW_AT_producer    : (indirect string, offset: 0xd75aa): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <b6>   DW_AT_language    : 12	(ANSI C99)
    <b7>   DW_AT_name        : (indirect string, offset: 0xe2b15): ../Core/Src/main.c
    <bb>   DW_AT_comp_dir    : (indirect string, offset: 0xa7272): /home/saveasmtz/Documents/embedded/stepper_board_firmware/Debug
    <bf>   DW_AT_ranges      : 0x18
    <c3>   DW_AT_low_pc      : 0x0
    <c7>   DW_AT_stmt_list   : 0x95f
    <cb>   DW_AT_GNU_macros  : 0x21e08
 <1><cf>: Abbrev Number: 2 (DW_TAG_base_type)
    <d0>   DW_AT_byte_size   : 1
    <d1>   DW_AT_encoding    : 6	(signed char)
    <d2>   DW_AT_name        : (indirect string, offset: 0x6eb2c): signed char
 <1><d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <d7>   DW_AT_name        : (indirect string, offset: 0xe0150): __uint8_t
    <db>   DW_AT_decl_file   : 4
    <dc>   DW_AT_decl_line   : 43
    <dd>   DW_AT_decl_column : 24
    <de>   DW_AT_type        : <0xe2>
 <1><e2>: Abbrev Number: 2 (DW_TAG_base_type)
    <e3>   DW_AT_byte_size   : 1
    <e4>   DW_AT_encoding    : 8	(unsigned char)
    <e5>   DW_AT_name        : (indirect string, offset: 0xd60a0): unsigned char
 <1><e9>: Abbrev Number: 2 (DW_TAG_base_type)
    <ea>   DW_AT_byte_size   : 2
    <eb>   DW_AT_encoding    : 5	(signed)
    <ec>   DW_AT_name        : (indirect string, offset: 0xa487f): short int
 <1><f0>: Abbrev Number: 3 (DW_TAG_typedef)
    <f1>   DW_AT_name        : (indirect string, offset: 0xe24c0): __uint16_t
    <f5>   DW_AT_decl_file   : 4
    <f6>   DW_AT_decl_line   : 57
    <f7>   DW_AT_decl_column : 25
    <f8>   DW_AT_type        : <0xfc>
 <1><fc>: Abbrev Number: 2 (DW_TAG_base_type)
    <fd>   DW_AT_byte_size   : 2
    <fe>   DW_AT_encoding    : 7	(unsigned)
    <ff>   DW_AT_name        : (indirect string, offset: 0xd47d2): short unsigned int
 <1><103>: Abbrev Number: 2 (DW_TAG_base_type)
    <104>   DW_AT_byte_size   : 4
    <105>   DW_AT_encoding    : 5	(signed)
    <106>   DW_AT_name        : (indirect string, offset: 0x12c15): long int
 <1><10a>: Abbrev Number: 3 (DW_TAG_typedef)
    <10b>   DW_AT_name        : (indirect string, offset: 0xe1946): __uint32_t
    <10f>   DW_AT_decl_file   : 4
    <110>   DW_AT_decl_line   : 79
    <111>   DW_AT_decl_column : 25
    <112>   DW_AT_type        : <0x116>
 <1><116>: Abbrev Number: 2 (DW_TAG_base_type)
    <117>   DW_AT_byte_size   : 4
    <118>   DW_AT_encoding    : 7	(unsigned)
    <119>   DW_AT_name        : (indirect string, offset: 0x534df): long unsigned int
 <1><11d>: Abbrev Number: 2 (DW_TAG_base_type)
    <11e>   DW_AT_byte_size   : 8
    <11f>   DW_AT_encoding    : 5	(signed)
    <120>   DW_AT_name        : (indirect string, offset: 0x64380): long long int
 <1><124>: Abbrev Number: 2 (DW_TAG_base_type)
    <125>   DW_AT_byte_size   : 8
    <126>   DW_AT_encoding    : 7	(unsigned)
    <127>   DW_AT_name        : (indirect string, offset: 0x2d99c): long long unsigned int
 <1><12b>: Abbrev Number: 4 (DW_TAG_base_type)
    <12c>   DW_AT_byte_size   : 4
    <12d>   DW_AT_encoding    : 5	(signed)
    <12e>   DW_AT_name        : int
 <1><132>: Abbrev Number: 2 (DW_TAG_base_type)
    <133>   DW_AT_byte_size   : 4
    <134>   DW_AT_encoding    : 7	(unsigned)
    <135>   DW_AT_name        : (indirect string, offset: 0x122d7): unsigned int
 <1><139>: Abbrev Number: 3 (DW_TAG_typedef)
    <13a>   DW_AT_name        : (indirect string, offset: 0xe0152): uint8_t
    <13e>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 24
    <140>   DW_AT_decl_column : 19
    <141>   DW_AT_type        : <0xd6>
 <1><145>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <146>   DW_AT_type        : <0x139>
 <1><14a>: Abbrev Number: 6 (DW_TAG_const_type)
    <14b>   DW_AT_type        : <0x139>
 <1><14f>: Abbrev Number: 3 (DW_TAG_typedef)
    <150>   DW_AT_name        : (indirect string, offset: 0xa1569): uint16_t
    <154>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 36
    <156>   DW_AT_decl_column : 20
    <157>   DW_AT_type        : <0xf0>
 <1><15b>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <15c>   DW_AT_type        : <0x14f>
 <1><160>: Abbrev Number: 3 (DW_TAG_typedef)
    <161>   DW_AT_name        : (indirect string, offset: 0xa0bc0): uint32_t
    <165>   DW_AT_decl_file   : 5
    <166>   DW_AT_decl_line   : 48
    <167>   DW_AT_decl_column : 20
    <168>   DW_AT_type        : <0x10a>
 <1><16c>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <16d>   DW_AT_type        : <0x160>
 <1><171>: Abbrev Number: 6 (DW_TAG_const_type)
    <172>   DW_AT_type        : <0x16c>
 <1><176>: Abbrev Number: 7 (DW_TAG_union_type)
    <177>   DW_AT_byte_size   : 4
    <178>   DW_AT_decl_file   : 1
    <179>   DW_AT_decl_line   : 813
    <17b>   DW_AT_decl_column : 9
    <17c>   DW_AT_sibling     : <0x1a7>
 <2><180>: Abbrev Number: 8 (DW_TAG_member)
    <181>   DW_AT_name        : u8
    <184>   DW_AT_decl_file   : 1
    <185>   DW_AT_decl_line   : 815
    <187>   DW_AT_decl_column : 22
    <188>   DW_AT_type        : <0x145>
 <2><18c>: Abbrev Number: 8 (DW_TAG_member)
    <18d>   DW_AT_name        : u16
    <191>   DW_AT_decl_file   : 1
    <192>   DW_AT_decl_line   : 816
    <194>   DW_AT_decl_column : 22
    <195>   DW_AT_type        : <0x15b>
 <2><199>: Abbrev Number: 8 (DW_TAG_member)
    <19a>   DW_AT_name        : u32
    <19e>   DW_AT_decl_file   : 1
    <19f>   DW_AT_decl_line   : 817
    <1a1>   DW_AT_decl_column : 22
    <1a2>   DW_AT_type        : <0x16c>
 <2><1a6>: Abbrev Number: 0
 <1><1a7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1a8>   DW_AT_type        : <0x176>
 <1><1ac>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1ad>   DW_AT_byte_size   : 4096
    <1af>   DW_AT_decl_file   : 1
    <1b0>   DW_AT_decl_line   : 811
    <1b2>   DW_AT_decl_column : 9
    <1b3>   DW_AT_sibling     : <0x31e>
 <2><1b7>: Abbrev Number: 10 (DW_TAG_member)
    <1b8>   DW_AT_name        : (indirect string, offset: 0xe0df3): PORT
    <1bc>   DW_AT_decl_file   : 1
    <1bd>   DW_AT_decl_line   : 818
    <1bf>   DW_AT_decl_column : 6
    <1c0>   DW_AT_type        : <0x32e>
    <1c4>   DW_AT_data_member_location: 0
 <2><1c5>: Abbrev Number: 10 (DW_TAG_member)
    <1c6>   DW_AT_name        : (indirect string, offset: 0xe2e9a): RESERVED0
    <1ca>   DW_AT_decl_file   : 1
    <1cb>   DW_AT_decl_line   : 819
    <1cd>   DW_AT_decl_column : 18
    <1ce>   DW_AT_type        : <0x333>
    <1d2>   DW_AT_data_member_location: 128
 <2><1d3>: Abbrev Number: 11 (DW_TAG_member)
    <1d4>   DW_AT_name        : TER
    <1d8>   DW_AT_decl_file   : 1
    <1d9>   DW_AT_decl_line   : 820
    <1db>   DW_AT_decl_column : 18
    <1dc>   DW_AT_type        : <0x16c>
    <1e0>   DW_AT_data_member_location: 3584
 <2><1e2>: Abbrev Number: 12 (DW_TAG_member)
    <1e3>   DW_AT_name        : (indirect string, offset: 0xe2ea4): RESERVED1
    <1e7>   DW_AT_decl_file   : 1
    <1e8>   DW_AT_decl_line   : 821
    <1ea>   DW_AT_decl_column : 18
    <1eb>   DW_AT_type        : <0x344>
    <1ef>   DW_AT_data_member_location: 3588
 <2><1f1>: Abbrev Number: 11 (DW_TAG_member)
    <1f2>   DW_AT_name        : TPR
    <1f6>   DW_AT_decl_file   : 1
    <1f7>   DW_AT_decl_line   : 822
    <1f9>   DW_AT_decl_column : 18
    <1fa>   DW_AT_type        : <0x16c>
    <1fe>   DW_AT_data_member_location: 3648
 <2><200>: Abbrev Number: 12 (DW_TAG_member)
    <201>   DW_AT_name        : (indirect string, offset: 0xe2eae): RESERVED2
    <205>   DW_AT_decl_file   : 1
    <206>   DW_AT_decl_line   : 823
    <208>   DW_AT_decl_column : 18
    <209>   DW_AT_type        : <0x344>
    <20d>   DW_AT_data_member_location: 3652
 <2><20f>: Abbrev Number: 11 (DW_TAG_member)
    <210>   DW_AT_name        : TCR
    <214>   DW_AT_decl_file   : 1
    <215>   DW_AT_decl_line   : 824
    <217>   DW_AT_decl_column : 18
    <218>   DW_AT_type        : <0x16c>
    <21c>   DW_AT_data_member_location: 3712
 <2><21e>: Abbrev Number: 12 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0xe2eb8): RESERVED3
    <223>   DW_AT_decl_file   : 1
    <224>   DW_AT_decl_line   : 825
    <226>   DW_AT_decl_column : 18
    <227>   DW_AT_type        : <0x354>
    <22b>   DW_AT_data_member_location: 3716
 <2><22d>: Abbrev Number: 12 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0xe1606): RESERVED4
    <232>   DW_AT_decl_file   : 1
    <233>   DW_AT_decl_line   : 826
    <235>   DW_AT_decl_column : 18
    <236>   DW_AT_type        : <0x364>
    <23a>   DW_AT_data_member_location: 3844
 <2><23c>: Abbrev Number: 11 (DW_TAG_member)
    <23d>   DW_AT_name        : LAR
    <241>   DW_AT_decl_file   : 1
    <242>   DW_AT_decl_line   : 827
    <244>   DW_AT_decl_column : 18
    <245>   DW_AT_type        : <0x16c>
    <249>   DW_AT_data_member_location: 4016
 <2><24b>: Abbrev Number: 11 (DW_TAG_member)
    <24c>   DW_AT_name        : LSR
    <250>   DW_AT_decl_file   : 1
    <251>   DW_AT_decl_line   : 828
    <253>   DW_AT_decl_column : 18
    <254>   DW_AT_type        : <0x171>
    <258>   DW_AT_data_member_location: 4020
 <2><25a>: Abbrev Number: 12 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xe2ec2): RESERVED5
    <25f>   DW_AT_decl_file   : 1
    <260>   DW_AT_decl_line   : 829
    <262>   DW_AT_decl_column : 18
    <263>   DW_AT_type        : <0x374>
    <267>   DW_AT_data_member_location: 4024
 <2><269>: Abbrev Number: 12 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0xe081b): PID4
    <26e>   DW_AT_decl_file   : 1
    <26f>   DW_AT_decl_line   : 830
    <271>   DW_AT_decl_column : 18
    <272>   DW_AT_type        : <0x171>
    <276>   DW_AT_data_member_location: 4048
 <2><278>: Abbrev Number: 12 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0xe0820): PID5
    <27d>   DW_AT_decl_file   : 1
    <27e>   DW_AT_decl_line   : 831
    <280>   DW_AT_decl_column : 18
    <281>   DW_AT_type        : <0x171>
    <285>   DW_AT_data_member_location: 4052
 <2><287>: Abbrev Number: 12 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0xe0825): PID6
    <28c>   DW_AT_decl_file   : 1
    <28d>   DW_AT_decl_line   : 832
    <28f>   DW_AT_decl_column : 18
    <290>   DW_AT_type        : <0x171>
    <294>   DW_AT_data_member_location: 4056
 <2><296>: Abbrev Number: 12 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xe082a): PID7
    <29b>   DW_AT_decl_file   : 1
    <29c>   DW_AT_decl_line   : 833
    <29e>   DW_AT_decl_column : 18
    <29f>   DW_AT_type        : <0x171>
    <2a3>   DW_AT_data_member_location: 4060
 <2><2a5>: Abbrev Number: 12 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0xe2330): PID0
    <2aa>   DW_AT_decl_file   : 1
    <2ab>   DW_AT_decl_line   : 834
    <2ad>   DW_AT_decl_column : 18
    <2ae>   DW_AT_type        : <0x171>
    <2b2>   DW_AT_data_member_location: 4064
 <2><2b4>: Abbrev Number: 12 (DW_TAG_member)
    <2b5>   DW_AT_name        : (indirect string, offset: 0xe2335): PID1
    <2b9>   DW_AT_decl_file   : 1
    <2ba>   DW_AT_decl_line   : 835
    <2bc>   DW_AT_decl_column : 18
    <2bd>   DW_AT_type        : <0x171>
    <2c1>   DW_AT_data_member_location: 4068
 <2><2c3>: Abbrev Number: 12 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0xdf643): PID2
    <2c8>   DW_AT_decl_file   : 1
    <2c9>   DW_AT_decl_line   : 836
    <2cb>   DW_AT_decl_column : 18
    <2cc>   DW_AT_type        : <0x171>
    <2d0>   DW_AT_data_member_location: 4072
 <2><2d2>: Abbrev Number: 12 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0xe0816): PID3
    <2d7>   DW_AT_decl_file   : 1
    <2d8>   DW_AT_decl_line   : 837
    <2da>   DW_AT_decl_column : 18
    <2db>   DW_AT_type        : <0x171>
    <2df>   DW_AT_data_member_location: 4076
 <2><2e1>: Abbrev Number: 12 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0xdebf2): CID0
    <2e6>   DW_AT_decl_file   : 1
    <2e7>   DW_AT_decl_line   : 838
    <2e9>   DW_AT_decl_column : 18
    <2ea>   DW_AT_type        : <0x171>
    <2ee>   DW_AT_data_member_location: 4080
 <2><2f0>: Abbrev Number: 12 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0xdebf7): CID1
    <2f5>   DW_AT_decl_file   : 1
    <2f6>   DW_AT_decl_line   : 839
    <2f8>   DW_AT_decl_column : 18
    <2f9>   DW_AT_type        : <0x171>
    <2fd>   DW_AT_data_member_location: 4084
 <2><2ff>: Abbrev Number: 12 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0xdebfc): CID2
    <304>   DW_AT_decl_file   : 1
    <305>   DW_AT_decl_line   : 840
    <307>   DW_AT_decl_column : 18
    <308>   DW_AT_type        : <0x171>
    <30c>   DW_AT_data_member_location: 4088
 <2><30e>: Abbrev Number: 12 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xdec01): CID3
    <313>   DW_AT_decl_file   : 1
    <314>   DW_AT_decl_line   : 841
    <316>   DW_AT_decl_column : 18
    <317>   DW_AT_type        : <0x171>
    <31b>   DW_AT_data_member_location: 4092
 <2><31d>: Abbrev Number: 0
 <1><31e>: Abbrev Number: 13 (DW_TAG_array_type)
    <31f>   DW_AT_type        : <0x1a7>
    <323>   DW_AT_sibling     : <0x32e>
 <2><327>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <328>   DW_AT_type        : <0x132>
    <32c>   DW_AT_upper_bound : 31
 <2><32d>: Abbrev Number: 0
 <1><32e>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <32f>   DW_AT_type        : <0x31e>
 <1><333>: Abbrev Number: 13 (DW_TAG_array_type)
    <334>   DW_AT_type        : <0x160>
    <338>   DW_AT_sibling     : <0x344>
 <2><33c>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <33d>   DW_AT_type        : <0x132>
    <341>   DW_AT_upper_bound : 863
 <2><343>: Abbrev Number: 0
 <1><344>: Abbrev Number: 13 (DW_TAG_array_type)
    <345>   DW_AT_type        : <0x160>
    <349>   DW_AT_sibling     : <0x354>
 <2><34d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <34e>   DW_AT_type        : <0x132>
    <352>   DW_AT_upper_bound : 14
 <2><353>: Abbrev Number: 0
 <1><354>: Abbrev Number: 13 (DW_TAG_array_type)
    <355>   DW_AT_type        : <0x160>
    <359>   DW_AT_sibling     : <0x364>
 <2><35d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <35e>   DW_AT_type        : <0x132>
    <362>   DW_AT_upper_bound : 31
 <2><363>: Abbrev Number: 0
 <1><364>: Abbrev Number: 13 (DW_TAG_array_type)
    <365>   DW_AT_type        : <0x160>
    <369>   DW_AT_sibling     : <0x374>
 <2><36d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <36e>   DW_AT_type        : <0x132>
    <372>   DW_AT_upper_bound : 42
 <2><373>: Abbrev Number: 0
 <1><374>: Abbrev Number: 13 (DW_TAG_array_type)
    <375>   DW_AT_type        : <0x160>
    <379>   DW_AT_sibling     : <0x384>
 <2><37d>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <37e>   DW_AT_type        : <0x132>
    <382>   DW_AT_upper_bound : 5
 <2><383>: Abbrev Number: 0
 <1><384>: Abbrev Number: 16 (DW_TAG_typedef)
    <385>   DW_AT_name        : (indirect string, offset: 0xe2527): ITM_Type
    <389>   DW_AT_decl_file   : 1
    <38a>   DW_AT_decl_line   : 842
    <38c>   DW_AT_decl_column : 3
    <38d>   DW_AT_type        : <0x1ac>
 <1><391>: Abbrev Number: 13 (DW_TAG_array_type)
    <392>   DW_AT_type        : <0x160>
    <396>   DW_AT_sibling     : <0x3a1>
 <2><39a>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <39b>   DW_AT_type        : <0x132>
    <39f>   DW_AT_upper_bound : 7
 <2><3a0>: Abbrev Number: 0
 <1><3a1>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3a2>   DW_AT_byte_size   : 184
    <3a3>   DW_AT_decl_file   : 6
    <3a4>   DW_AT_decl_line   : 160
    <3a5>   DW_AT_decl_column : 9
    <3a6>   DW_AT_sibling     : <0x58a>
 <2><3aa>: Abbrev Number: 18 (DW_TAG_member)
    <3ab>   DW_AT_name        : ISR
    <3af>   DW_AT_decl_file   : 6
    <3b0>   DW_AT_decl_line   : 162
    <3b1>   DW_AT_decl_column : 17
    <3b2>   DW_AT_type        : <0x16c>
    <3b6>   DW_AT_data_member_location: 0
 <2><3b7>: Abbrev Number: 18 (DW_TAG_member)
    <3b8>   DW_AT_name        : IER
    <3bc>   DW_AT_decl_file   : 6
    <3bd>   DW_AT_decl_line   : 163
    <3be>   DW_AT_decl_column : 17
    <3bf>   DW_AT_type        : <0x16c>
    <3c3>   DW_AT_data_member_location: 4
 <2><3c4>: Abbrev Number: 18 (DW_TAG_member)
    <3c5>   DW_AT_name        : CR
    <3c8>   DW_AT_decl_file   : 6
    <3c9>   DW_AT_decl_line   : 164
    <3ca>   DW_AT_decl_column : 17
    <3cb>   DW_AT_type        : <0x16c>
    <3cf>   DW_AT_data_member_location: 8
 <2><3d0>: Abbrev Number: 19 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0xe049b): CFGR
    <3d5>   DW_AT_decl_file   : 6
    <3d6>   DW_AT_decl_line   : 165
    <3d7>   DW_AT_decl_column : 17
    <3d8>   DW_AT_type        : <0x16c>
    <3dc>   DW_AT_data_member_location: 12
 <2><3dd>: Abbrev Number: 19 (DW_TAG_member)
    <3de>   DW_AT_name        : (indirect string, offset: 0xe15a2): CFGR2
    <3e2>   DW_AT_decl_file   : 6
    <3e3>   DW_AT_decl_line   : 166
    <3e4>   DW_AT_decl_column : 17
    <3e5>   DW_AT_type        : <0x16c>
    <3e9>   DW_AT_data_member_location: 16
 <2><3ea>: Abbrev Number: 19 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0xb293a): SMPR1
    <3ef>   DW_AT_decl_file   : 6
    <3f0>   DW_AT_decl_line   : 167
    <3f1>   DW_AT_decl_column : 17
    <3f2>   DW_AT_type        : <0x16c>
    <3f6>   DW_AT_data_member_location: 20
 <2><3f7>: Abbrev Number: 19 (DW_TAG_member)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x4dd55): SMPR2
    <3fc>   DW_AT_decl_file   : 6
    <3fd>   DW_AT_decl_line   : 168
    <3fe>   DW_AT_decl_column : 17
    <3ff>   DW_AT_type        : <0x16c>
    <403>   DW_AT_data_member_location: 24
 <2><404>: Abbrev Number: 19 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0xe2ea4): RESERVED1
    <409>   DW_AT_decl_file   : 6
    <40a>   DW_AT_decl_line   : 169
    <40b>   DW_AT_decl_column : 17
    <40c>   DW_AT_type        : <0x160>
    <410>   DW_AT_data_member_location: 28
 <2><411>: Abbrev Number: 18 (DW_TAG_member)
    <412>   DW_AT_name        : TR1
    <416>   DW_AT_decl_file   : 6
    <417>   DW_AT_decl_line   : 170
    <418>   DW_AT_decl_column : 17
    <419>   DW_AT_type        : <0x16c>
    <41d>   DW_AT_data_member_location: 32
 <2><41e>: Abbrev Number: 18 (DW_TAG_member)
    <41f>   DW_AT_name        : TR2
    <423>   DW_AT_decl_file   : 6
    <424>   DW_AT_decl_line   : 171
    <425>   DW_AT_decl_column : 17
    <426>   DW_AT_type        : <0x16c>
    <42a>   DW_AT_data_member_location: 36
 <2><42b>: Abbrev Number: 18 (DW_TAG_member)
    <42c>   DW_AT_name        : TR3
    <430>   DW_AT_decl_file   : 6
    <431>   DW_AT_decl_line   : 172
    <432>   DW_AT_decl_column : 17
    <433>   DW_AT_type        : <0x16c>
    <437>   DW_AT_data_member_location: 40
 <2><438>: Abbrev Number: 19 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0xe2eae): RESERVED2
    <43d>   DW_AT_decl_file   : 6
    <43e>   DW_AT_decl_line   : 173
    <43f>   DW_AT_decl_column : 17
    <440>   DW_AT_type        : <0x160>
    <444>   DW_AT_data_member_location: 44
 <2><445>: Abbrev Number: 19 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0x9a41f): SQR1
    <44a>   DW_AT_decl_file   : 6
    <44b>   DW_AT_decl_line   : 174
    <44c>   DW_AT_decl_column : 17
    <44d>   DW_AT_type        : <0x16c>
    <451>   DW_AT_data_member_location: 48
 <2><452>: Abbrev Number: 19 (DW_TAG_member)
    <453>   DW_AT_name        : (indirect string, offset: 0xdf029): SQR2
    <457>   DW_AT_decl_file   : 6
    <458>   DW_AT_decl_line   : 175
    <459>   DW_AT_decl_column : 17
    <45a>   DW_AT_type        : <0x16c>
    <45e>   DW_AT_data_member_location: 52
 <2><45f>: Abbrev Number: 19 (DW_TAG_member)
    <460>   DW_AT_name        : (indirect string, offset: 0xdf02e): SQR3
    <464>   DW_AT_decl_file   : 6
    <465>   DW_AT_decl_line   : 176
    <466>   DW_AT_decl_column : 17
    <467>   DW_AT_type        : <0x16c>
    <46b>   DW_AT_data_member_location: 56
 <2><46c>: Abbrev Number: 19 (DW_TAG_member)
    <46d>   DW_AT_name        : (indirect string, offset: 0xdf033): SQR4
    <471>   DW_AT_decl_file   : 6
    <472>   DW_AT_decl_line   : 177
    <473>   DW_AT_decl_column : 17
    <474>   DW_AT_type        : <0x16c>
    <478>   DW_AT_data_member_location: 60
 <2><479>: Abbrev Number: 18 (DW_TAG_member)
    <47a>   DW_AT_name        : DR
    <47d>   DW_AT_decl_file   : 6
    <47e>   DW_AT_decl_line   : 178
    <47f>   DW_AT_decl_column : 17
    <480>   DW_AT_type        : <0x16c>
    <484>   DW_AT_data_member_location: 64
 <2><485>: Abbrev Number: 19 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0xe2eb8): RESERVED3
    <48a>   DW_AT_decl_file   : 6
    <48b>   DW_AT_decl_line   : 179
    <48c>   DW_AT_decl_column : 17
    <48d>   DW_AT_type        : <0x160>
    <491>   DW_AT_data_member_location: 68
 <2><492>: Abbrev Number: 19 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0xe1606): RESERVED4
    <497>   DW_AT_decl_file   : 6
    <498>   DW_AT_decl_line   : 180
    <499>   DW_AT_decl_column : 17
    <49a>   DW_AT_type        : <0x160>
    <49e>   DW_AT_data_member_location: 72
 <2><49f>: Abbrev Number: 19 (DW_TAG_member)
    <4a0>   DW_AT_name        : (indirect string, offset: 0xaa0e7): JSQR
    <4a4>   DW_AT_decl_file   : 6
    <4a5>   DW_AT_decl_line   : 181
    <4a6>   DW_AT_decl_column : 17
    <4a7>   DW_AT_type        : <0x16c>
    <4ab>   DW_AT_data_member_location: 76
 <2><4ac>: Abbrev Number: 19 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0xe2ec2): RESERVED5
    <4b1>   DW_AT_decl_file   : 6
    <4b2>   DW_AT_decl_line   : 182
    <4b3>   DW_AT_decl_column : 17
    <4b4>   DW_AT_type        : <0x58a>
    <4b8>   DW_AT_data_member_location: 80
 <2><4b9>: Abbrev Number: 19 (DW_TAG_member)
    <4ba>   DW_AT_name        : (indirect string, offset: 0xe1b17): OFR1
    <4be>   DW_AT_decl_file   : 6
    <4bf>   DW_AT_decl_line   : 183
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0x16c>
    <4c5>   DW_AT_data_member_location: 96
 <2><4c6>: Abbrev Number: 19 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0xe2619): OFR2
    <4cb>   DW_AT_decl_file   : 6
    <4cc>   DW_AT_decl_line   : 184
    <4cd>   DW_AT_decl_column : 17
    <4ce>   DW_AT_type        : <0x16c>
    <4d2>   DW_AT_data_member_location: 100
 <2><4d3>: Abbrev Number: 19 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0xe261e): OFR3
    <4d8>   DW_AT_decl_file   : 6
    <4d9>   DW_AT_decl_line   : 185
    <4da>   DW_AT_decl_column : 17
    <4db>   DW_AT_type        : <0x16c>
    <4df>   DW_AT_data_member_location: 104
 <2><4e0>: Abbrev Number: 19 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0xe2623): OFR4
    <4e5>   DW_AT_decl_file   : 6
    <4e6>   DW_AT_decl_line   : 186
    <4e7>   DW_AT_decl_column : 17
    <4e8>   DW_AT_type        : <0x16c>
    <4ec>   DW_AT_data_member_location: 108
 <2><4ed>: Abbrev Number: 19 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0xe2ecc): RESERVED6
    <4f2>   DW_AT_decl_file   : 6
    <4f3>   DW_AT_decl_line   : 187
    <4f4>   DW_AT_decl_column : 17
    <4f5>   DW_AT_type        : <0x58a>
    <4f9>   DW_AT_data_member_location: 112
 <2><4fa>: Abbrev Number: 19 (DW_TAG_member)
    <4fb>   DW_AT_name        : (indirect string, offset: 0xe196c): JDR1
    <4ff>   DW_AT_decl_file   : 6
    <500>   DW_AT_decl_line   : 188
    <501>   DW_AT_decl_column : 17
    <502>   DW_AT_type        : <0x16c>
    <506>   DW_AT_data_member_location: 128
 <2><507>: Abbrev Number: 19 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0xe1971): JDR2
    <50c>   DW_AT_decl_file   : 6
    <50d>   DW_AT_decl_line   : 189
    <50e>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0x16c>
    <513>   DW_AT_data_member_location: 132
 <2><514>: Abbrev Number: 19 (DW_TAG_member)
    <515>   DW_AT_name        : (indirect string, offset: 0xe1976): JDR3
    <519>   DW_AT_decl_file   : 6
    <51a>   DW_AT_decl_line   : 190
    <51b>   DW_AT_decl_column : 17
    <51c>   DW_AT_type        : <0x16c>
    <520>   DW_AT_data_member_location: 136
 <2><521>: Abbrev Number: 19 (DW_TAG_member)
    <522>   DW_AT_name        : (indirect string, offset: 0xdffab): JDR4
    <526>   DW_AT_decl_file   : 6
    <527>   DW_AT_decl_line   : 191
    <528>   DW_AT_decl_column : 17
    <529>   DW_AT_type        : <0x16c>
    <52d>   DW_AT_data_member_location: 140
 <2><52e>: Abbrev Number: 19 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0xe2ed6): RESERVED7
    <533>   DW_AT_decl_file   : 6
    <534>   DW_AT_decl_line   : 192
    <535>   DW_AT_decl_column : 17
    <536>   DW_AT_type        : <0x58a>
    <53a>   DW_AT_data_member_location: 144
 <2><53b>: Abbrev Number: 19 (DW_TAG_member)
    <53c>   DW_AT_name        : (indirect string, offset: 0xe193f): AWD2CR
    <540>   DW_AT_decl_file   : 6
    <541>   DW_AT_decl_line   : 193
    <542>   DW_AT_decl_column : 17
    <543>   DW_AT_type        : <0x16c>
    <547>   DW_AT_data_member_location: 160
 <2><548>: Abbrev Number: 19 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0xe2231): AWD3CR
    <54d>   DW_AT_decl_file   : 6
    <54e>   DW_AT_decl_line   : 194
    <54f>   DW_AT_decl_column : 17
    <550>   DW_AT_type        : <0x16c>
    <554>   DW_AT_data_member_location: 164
 <2><555>: Abbrev Number: 19 (DW_TAG_member)
    <556>   DW_AT_name        : (indirect string, offset: 0xe2ee0): RESERVED8
    <55a>   DW_AT_decl_file   : 6
    <55b>   DW_AT_decl_line   : 195
    <55c>   DW_AT_decl_column : 17
    <55d>   DW_AT_type        : <0x160>
    <561>   DW_AT_data_member_location: 168
 <2><562>: Abbrev Number: 19 (DW_TAG_member)
    <563>   DW_AT_name        : (indirect string, offset: 0xe2eea): RESERVED9
    <567>   DW_AT_decl_file   : 6
    <568>   DW_AT_decl_line   : 196
    <569>   DW_AT_decl_column : 17
    <56a>   DW_AT_type        : <0x160>
    <56e>   DW_AT_data_member_location: 172
 <2><56f>: Abbrev Number: 19 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0xe05c4): DIFSEL
    <574>   DW_AT_decl_file   : 6
    <575>   DW_AT_decl_line   : 197
    <576>   DW_AT_decl_column : 17
    <577>   DW_AT_type        : <0x16c>
    <57b>   DW_AT_data_member_location: 176
 <2><57c>: Abbrev Number: 19 (DW_TAG_member)
    <57d>   DW_AT_name        : (indirect string, offset: 0xe04be): CALFACT
    <581>   DW_AT_decl_file   : 6
    <582>   DW_AT_decl_line   : 198
    <583>   DW_AT_decl_column : 17
    <584>   DW_AT_type        : <0x16c>
    <588>   DW_AT_data_member_location: 180
 <2><589>: Abbrev Number: 0
 <1><58a>: Abbrev Number: 13 (DW_TAG_array_type)
    <58b>   DW_AT_type        : <0x160>
    <58f>   DW_AT_sibling     : <0x59a>
 <2><593>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <594>   DW_AT_type        : <0x132>
    <598>   DW_AT_upper_bound : 3
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 3 (DW_TAG_typedef)
    <59b>   DW_AT_name        : (indirect string, offset: 0xe21c7): ADC_TypeDef
    <59f>   DW_AT_decl_file   : 6
    <5a0>   DW_AT_decl_line   : 200
    <5a1>   DW_AT_decl_column : 3
    <5a2>   DW_AT_type        : <0x3a1>
 <1><5a6>: Abbrev Number: 17 (DW_TAG_structure_type)
    <5a7>   DW_AT_byte_size   : 16
    <5a8>   DW_AT_decl_file   : 6
    <5a9>   DW_AT_decl_line   : 215
    <5aa>   DW_AT_decl_column : 9
    <5ab>   DW_AT_sibling     : <0x5e4>
 <2><5af>: Abbrev Number: 18 (DW_TAG_member)
    <5b0>   DW_AT_name        : TIR
    <5b4>   DW_AT_decl_file   : 6
    <5b5>   DW_AT_decl_line   : 217
    <5b6>   DW_AT_decl_column : 17
    <5b7>   DW_AT_type        : <0x16c>
    <5bb>   DW_AT_data_member_location: 0
 <2><5bc>: Abbrev Number: 19 (DW_TAG_member)
    <5bd>   DW_AT_name        : (indirect string, offset: 0xe0d48): TDTR
    <5c1>   DW_AT_decl_file   : 6
    <5c2>   DW_AT_decl_line   : 218
    <5c3>   DW_AT_decl_column : 17
    <5c4>   DW_AT_type        : <0x16c>
    <5c8>   DW_AT_data_member_location: 4
 <2><5c9>: Abbrev Number: 19 (DW_TAG_member)
    <5ca>   DW_AT_name        : (indirect string, offset: 0xe0c2b): TDLR
    <5ce>   DW_AT_decl_file   : 6
    <5cf>   DW_AT_decl_line   : 219
    <5d0>   DW_AT_decl_column : 17
    <5d1>   DW_AT_type        : <0x16c>
    <5d5>   DW_AT_data_member_location: 8
 <2><5d6>: Abbrev Number: 19 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0xe0ba3): TDHR
    <5db>   DW_AT_decl_file   : 6
    <5dc>   DW_AT_decl_line   : 220
    <5dd>   DW_AT_decl_column : 17
    <5de>   DW_AT_type        : <0x16c>
    <5e2>   DW_AT_data_member_location: 12
 <2><5e3>: Abbrev Number: 0
 <1><5e4>: Abbrev Number: 3 (DW_TAG_typedef)
    <5e5>   DW_AT_name        : (indirect string, offset: 0xe1610): CAN_TxMailBox_TypeDef
    <5e9>   DW_AT_decl_file   : 6
    <5ea>   DW_AT_decl_line   : 221
    <5eb>   DW_AT_decl_column : 3
    <5ec>   DW_AT_type        : <0x5a6>
 <1><5f0>: Abbrev Number: 17 (DW_TAG_structure_type)
    <5f1>   DW_AT_byte_size   : 16
    <5f2>   DW_AT_decl_file   : 6
    <5f3>   DW_AT_decl_line   : 227
    <5f4>   DW_AT_decl_column : 9
    <5f5>   DW_AT_sibling     : <0x62e>
 <2><5f9>: Abbrev Number: 18 (DW_TAG_member)
    <5fa>   DW_AT_name        : RIR
    <5fe>   DW_AT_decl_file   : 6
    <5ff>   DW_AT_decl_line   : 229
    <600>   DW_AT_decl_column : 17
    <601>   DW_AT_type        : <0x16c>
    <605>   DW_AT_data_member_location: 0
 <2><606>: Abbrev Number: 19 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0xdf262): RDTR
    <60b>   DW_AT_decl_file   : 6
    <60c>   DW_AT_decl_line   : 230
    <60d>   DW_AT_decl_column : 17
    <60e>   DW_AT_type        : <0x16c>
    <612>   DW_AT_data_member_location: 4
 <2><613>: Abbrev Number: 19 (DW_TAG_member)
    <614>   DW_AT_name        : (indirect string, offset: 0xdf159): RDLR
    <618>   DW_AT_decl_file   : 6
    <619>   DW_AT_decl_line   : 231
    <61a>   DW_AT_decl_column : 17
    <61b>   DW_AT_type        : <0x16c>
    <61f>   DW_AT_data_member_location: 8
 <2><620>: Abbrev Number: 19 (DW_TAG_member)
    <621>   DW_AT_name        : (indirect string, offset: 0xdf135): RDHR
    <625>   DW_AT_decl_file   : 6
    <626>   DW_AT_decl_line   : 232
    <627>   DW_AT_decl_column : 17
    <628>   DW_AT_type        : <0x16c>
    <62c>   DW_AT_data_member_location: 12
 <2><62d>: Abbrev Number: 0
 <1><62e>: Abbrev Number: 3 (DW_TAG_typedef)
    <62f>   DW_AT_name        : (indirect string, offset: 0xdfbb3): CAN_FIFOMailBox_TypeDef
    <633>   DW_AT_decl_file   : 6
    <634>   DW_AT_decl_line   : 233
    <635>   DW_AT_decl_column : 3
    <636>   DW_AT_type        : <0x5f0>
 <1><63a>: Abbrev Number: 17 (DW_TAG_structure_type)
    <63b>   DW_AT_byte_size   : 8
    <63c>   DW_AT_decl_file   : 6
    <63d>   DW_AT_decl_line   : 239
    <63e>   DW_AT_decl_column : 9
    <63f>   DW_AT_sibling     : <0x65e>
 <2><643>: Abbrev Number: 18 (DW_TAG_member)
    <644>   DW_AT_name        : FR1
    <648>   DW_AT_decl_file   : 6
    <649>   DW_AT_decl_line   : 241
    <64a>   DW_AT_decl_column : 17
    <64b>   DW_AT_type        : <0x16c>
    <64f>   DW_AT_data_member_location: 0
 <2><650>: Abbrev Number: 18 (DW_TAG_member)
    <651>   DW_AT_name        : FR2
    <655>   DW_AT_decl_file   : 6
    <656>   DW_AT_decl_line   : 242
    <657>   DW_AT_decl_column : 17
    <658>   DW_AT_type        : <0x16c>
    <65c>   DW_AT_data_member_location: 4
 <2><65d>: Abbrev Number: 0
 <1><65e>: Abbrev Number: 3 (DW_TAG_typedef)
    <65f>   DW_AT_name        : (indirect string, offset: 0xe0c43): CAN_FilterRegister_TypeDef
    <663>   DW_AT_decl_file   : 6
    <664>   DW_AT_decl_line   : 243
    <665>   DW_AT_decl_column : 3
    <666>   DW_AT_type        : <0x63a>
 <1><66a>: Abbrev Number: 20 (DW_TAG_structure_type)
    <66b>   DW_AT_byte_size   : 800
    <66d>   DW_AT_decl_file   : 6
    <66e>   DW_AT_decl_line   : 249
    <66f>   DW_AT_decl_column : 9
    <670>   DW_AT_sibling     : <0x7b1>
 <2><674>: Abbrev Number: 18 (DW_TAG_member)
    <675>   DW_AT_name        : MCR
    <679>   DW_AT_decl_file   : 6
    <67a>   DW_AT_decl_line   : 251
    <67b>   DW_AT_decl_column : 30
    <67c>   DW_AT_type        : <0x16c>
    <680>   DW_AT_data_member_location: 0
 <2><681>: Abbrev Number: 18 (DW_TAG_member)
    <682>   DW_AT_name        : MSR
    <686>   DW_AT_decl_file   : 6
    <687>   DW_AT_decl_line   : 252
    <688>   DW_AT_decl_column : 30
    <689>   DW_AT_type        : <0x16c>
    <68d>   DW_AT_data_member_location: 4
 <2><68e>: Abbrev Number: 18 (DW_TAG_member)
    <68f>   DW_AT_name        : TSR
    <693>   DW_AT_decl_file   : 6
    <694>   DW_AT_decl_line   : 253
    <695>   DW_AT_decl_column : 30
    <696>   DW_AT_type        : <0x16c>
    <69a>   DW_AT_data_member_location: 8
 <2><69b>: Abbrev Number: 19 (DW_TAG_member)
    <69c>   DW_AT_name        : (indirect string, offset: 0xe03bd): RF0R
    <6a0>   DW_AT_decl_file   : 6
    <6a1>   DW_AT_decl_line   : 254
    <6a2>   DW_AT_decl_column : 30
    <6a3>   DW_AT_type        : <0x16c>
    <6a7>   DW_AT_data_member_location: 12
 <2><6a8>: Abbrev Number: 19 (DW_TAG_member)
    <6a9>   DW_AT_name        : (indirect string, offset: 0xe1904): RF1R
    <6ad>   DW_AT_decl_file   : 6
    <6ae>   DW_AT_decl_line   : 255
    <6af>   DW_AT_decl_column : 30
    <6b0>   DW_AT_type        : <0x16c>
    <6b4>   DW_AT_data_member_location: 16
 <2><6b5>: Abbrev Number: 21 (DW_TAG_member)
    <6b6>   DW_AT_name        : IER
    <6ba>   DW_AT_decl_file   : 6
    <6bb>   DW_AT_decl_line   : 256
    <6bd>   DW_AT_decl_column : 30
    <6be>   DW_AT_type        : <0x16c>
    <6c2>   DW_AT_data_member_location: 20
 <2><6c3>: Abbrev Number: 21 (DW_TAG_member)
    <6c4>   DW_AT_name        : ESR
    <6c8>   DW_AT_decl_file   : 6
    <6c9>   DW_AT_decl_line   : 257
    <6cb>   DW_AT_decl_column : 30
    <6cc>   DW_AT_type        : <0x16c>
    <6d0>   DW_AT_data_member_location: 24
 <2><6d1>: Abbrev Number: 21 (DW_TAG_member)
    <6d2>   DW_AT_name        : BTR
    <6d6>   DW_AT_decl_file   : 6
    <6d7>   DW_AT_decl_line   : 258
    <6d9>   DW_AT_decl_column : 30
    <6da>   DW_AT_type        : <0x16c>
    <6de>   DW_AT_data_member_location: 28
 <2><6df>: Abbrev Number: 10 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0xe2e9a): RESERVED0
    <6e4>   DW_AT_decl_file   : 6
    <6e5>   DW_AT_decl_line   : 259
    <6e7>   DW_AT_decl_column : 30
    <6e8>   DW_AT_type        : <0x7b1>
    <6ec>   DW_AT_data_member_location: 32
 <2><6ed>: Abbrev Number: 12 (DW_TAG_member)
    <6ee>   DW_AT_name        : (indirect string, offset: 0xe05b9): sTxMailBox
    <6f2>   DW_AT_decl_file   : 6
    <6f3>   DW_AT_decl_line   : 260
    <6f5>   DW_AT_decl_column : 30
    <6f6>   DW_AT_type        : <0x7c1>
    <6fa>   DW_AT_data_member_location: 384
 <2><6fc>: Abbrev Number: 12 (DW_TAG_member)
    <6fd>   DW_AT_name        : (indirect string, offset: 0xdfbd4): sFIFOMailBox
    <701>   DW_AT_decl_file   : 6
    <702>   DW_AT_decl_line   : 261
    <704>   DW_AT_decl_column : 30
    <705>   DW_AT_type        : <0x7d1>
    <709>   DW_AT_data_member_location: 432
 <2><70b>: Abbrev Number: 12 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0xe2ea4): RESERVED1
    <710>   DW_AT_decl_file   : 6
    <711>   DW_AT_decl_line   : 262
    <713>   DW_AT_decl_column : 30
    <714>   DW_AT_type        : <0x7e1>
    <718>   DW_AT_data_member_location: 464
 <2><71a>: Abbrev Number: 11 (DW_TAG_member)
    <71b>   DW_AT_name        : FMR
    <71f>   DW_AT_decl_file   : 6
    <720>   DW_AT_decl_line   : 263
    <722>   DW_AT_decl_column : 30
    <723>   DW_AT_type        : <0x16c>
    <727>   DW_AT_data_member_location: 512
 <2><729>: Abbrev Number: 12 (DW_TAG_member)
    <72a>   DW_AT_name        : (indirect string, offset: 0xdf013): FM1R
    <72e>   DW_AT_decl_file   : 6
    <72f>   DW_AT_decl_line   : 264
    <731>   DW_AT_decl_column : 30
    <732>   DW_AT_type        : <0x16c>
    <736>   DW_AT_data_member_location: 516
 <2><738>: Abbrev Number: 12 (DW_TAG_member)
    <739>   DW_AT_name        : (indirect string, offset: 0xe2eae): RESERVED2
    <73d>   DW_AT_decl_file   : 6
    <73e>   DW_AT_decl_line   : 265
    <740>   DW_AT_decl_column : 30
    <741>   DW_AT_type        : <0x160>
    <745>   DW_AT_data_member_location: 520
 <2><747>: Abbrev Number: 12 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0xe2baf): FS1R
    <74c>   DW_AT_decl_file   : 6
    <74d>   DW_AT_decl_line   : 266
    <74f>   DW_AT_decl_column : 30
    <750>   DW_AT_type        : <0x16c>
    <754>   DW_AT_data_member_location: 524
 <2><756>: Abbrev Number: 12 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0xe2eb8): RESERVED3
    <75b>   DW_AT_decl_file   : 6
    <75c>   DW_AT_decl_line   : 267
    <75e>   DW_AT_decl_column : 30
    <75f>   DW_AT_type        : <0x160>
    <763>   DW_AT_data_member_location: 528
 <2><765>: Abbrev Number: 12 (DW_TAG_member)
    <766>   DW_AT_name        : (indirect string, offset: 0xe1b57): FFA1R
    <76a>   DW_AT_decl_file   : 6
    <76b>   DW_AT_decl_line   : 268
    <76d>   DW_AT_decl_column : 30
    <76e>   DW_AT_type        : <0x16c>
    <772>   DW_AT_data_member_location: 532
 <2><774>: Abbrev Number: 12 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0xe1606): RESERVED4
    <779>   DW_AT_decl_file   : 6
    <77a>   DW_AT_decl_line   : 269
    <77c>   DW_AT_decl_column : 30
    <77d>   DW_AT_type        : <0x160>
    <781>   DW_AT_data_member_location: 536
 <2><783>: Abbrev Number: 12 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0xe1b58): FA1R
    <788>   DW_AT_decl_file   : 6
    <789>   DW_AT_decl_line   : 270
    <78b>   DW_AT_decl_column : 30
    <78c>   DW_AT_type        : <0x16c>
    <790>   DW_AT_data_member_location: 540
 <2><792>: Abbrev Number: 12 (DW_TAG_member)
    <793>   DW_AT_name        : (indirect string, offset: 0xe2ec2): RESERVED5
    <797>   DW_AT_decl_file   : 6
    <798>   DW_AT_decl_line   : 271
    <79a>   DW_AT_decl_column : 30
    <79b>   DW_AT_type        : <0x391>
    <79f>   DW_AT_data_member_location: 544
 <2><7a1>: Abbrev Number: 12 (DW_TAG_member)
    <7a2>   DW_AT_name        : (indirect string, offset: 0xe1548): sFilterRegister
    <7a6>   DW_AT_decl_file   : 6
    <7a7>   DW_AT_decl_line   : 272
    <7a9>   DW_AT_decl_column : 30
    <7aa>   DW_AT_type        : <0x7f1>
    <7ae>   DW_AT_data_member_location: 576
 <2><7b0>: Abbrev Number: 0
 <1><7b1>: Abbrev Number: 13 (DW_TAG_array_type)
    <7b2>   DW_AT_type        : <0x160>
    <7b6>   DW_AT_sibling     : <0x7c1>
 <2><7ba>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <7bb>   DW_AT_type        : <0x132>
    <7bf>   DW_AT_upper_bound : 87
 <2><7c0>: Abbrev Number: 0
 <1><7c1>: Abbrev Number: 13 (DW_TAG_array_type)
    <7c2>   DW_AT_type        : <0x5e4>
    <7c6>   DW_AT_sibling     : <0x7d1>
 <2><7ca>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <7cb>   DW_AT_type        : <0x132>
    <7cf>   DW_AT_upper_bound : 2
 <2><7d0>: Abbrev Number: 0
 <1><7d1>: Abbrev Number: 13 (DW_TAG_array_type)
    <7d2>   DW_AT_type        : <0x62e>
    <7d6>   DW_AT_sibling     : <0x7e1>
 <2><7da>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <7db>   DW_AT_type        : <0x132>
    <7df>   DW_AT_upper_bound : 1
 <2><7e0>: Abbrev Number: 0
 <1><7e1>: Abbrev Number: 13 (DW_TAG_array_type)
    <7e2>   DW_AT_type        : <0x160>
    <7e6>   DW_AT_sibling     : <0x7f1>
 <2><7ea>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <7eb>   DW_AT_type        : <0x132>
    <7ef>   DW_AT_upper_bound : 11
 <2><7f0>: Abbrev Number: 0
 <1><7f1>: Abbrev Number: 13 (DW_TAG_array_type)
    <7f2>   DW_AT_type        : <0x65e>
    <7f6>   DW_AT_sibling     : <0x801>
 <2><7fa>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <7fb>   DW_AT_type        : <0x132>
    <7ff>   DW_AT_upper_bound : 27
 <2><800>: Abbrev Number: 0
 <1><801>: Abbrev Number: 16 (DW_TAG_typedef)
    <802>   DW_AT_name        : (indirect string, offset: 0xe2b34): CAN_TypeDef
    <806>   DW_AT_decl_file   : 6
    <807>   DW_AT_decl_line   : 273
    <809>   DW_AT_decl_column : 3
    <80a>   DW_AT_type        : <0x66a>
 <1><80e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <80f>   DW_AT_byte_size   : 16
    <810>   DW_AT_decl_file   : 6
    <811>   DW_AT_decl_line   : 364
    <813>   DW_AT_decl_column : 9
    <814>   DW_AT_sibling     : <0x851>
 <2><818>: Abbrev Number: 21 (DW_TAG_member)
    <819>   DW_AT_name        : CCR
    <81d>   DW_AT_decl_file   : 6
    <81e>   DW_AT_decl_line   : 366
    <820>   DW_AT_decl_column : 17
    <821>   DW_AT_type        : <0x16c>
    <825>   DW_AT_data_member_location: 0
 <2><826>: Abbrev Number: 10 (DW_TAG_member)
    <827>   DW_AT_name        : (indirect string, offset: 0xe026b): CNDTR
    <82b>   DW_AT_decl_file   : 6
    <82c>   DW_AT_decl_line   : 367
    <82e>   DW_AT_decl_column : 17
    <82f>   DW_AT_type        : <0x16c>
    <833>   DW_AT_data_member_location: 4
 <2><834>: Abbrev Number: 10 (DW_TAG_member)
    <835>   DW_AT_name        : (indirect string, offset: 0xe3070): CPAR
    <839>   DW_AT_decl_file   : 6
    <83a>   DW_AT_decl_line   : 368
    <83c>   DW_AT_decl_column : 17
    <83d>   DW_AT_type        : <0x16c>
    <841>   DW_AT_data_member_location: 8
 <2><842>: Abbrev Number: 10 (DW_TAG_member)
    <843>   DW_AT_name        : (indirect string, offset: 0xe1323): CMAR
    <847>   DW_AT_decl_file   : 6
    <848>   DW_AT_decl_line   : 369
    <84a>   DW_AT_decl_column : 17
    <84b>   DW_AT_type        : <0x16c>
    <84f>   DW_AT_data_member_location: 12
 <2><850>: Abbrev Number: 0
 <1><851>: Abbrev Number: 16 (DW_TAG_typedef)
    <852>   DW_AT_name        : (indirect string, offset: 0xe2ef4): DMA_Channel_TypeDef
    <856>   DW_AT_decl_file   : 6
    <857>   DW_AT_decl_line   : 370
    <859>   DW_AT_decl_column : 3
    <85a>   DW_AT_type        : <0x80e>
 <1><85e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <85f>   DW_AT_byte_size   : 8
    <860>   DW_AT_decl_file   : 6
    <861>   DW_AT_decl_line   : 372
    <863>   DW_AT_decl_column : 9
    <864>   DW_AT_sibling     : <0x885>
 <2><868>: Abbrev Number: 21 (DW_TAG_member)
    <869>   DW_AT_name        : ISR
    <86d>   DW_AT_decl_file   : 6
    <86e>   DW_AT_decl_line   : 374
    <870>   DW_AT_decl_column : 17
    <871>   DW_AT_type        : <0x16c>
    <875>   DW_AT_data_member_location: 0
 <2><876>: Abbrev Number: 10 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0xe1e0a): IFCR
    <87b>   DW_AT_decl_file   : 6
    <87c>   DW_AT_decl_line   : 375
    <87e>   DW_AT_decl_column : 17
    <87f>   DW_AT_type        : <0x16c>
    <883>   DW_AT_data_member_location: 4
 <2><884>: Abbrev Number: 0
 <1><885>: Abbrev Number: 16 (DW_TAG_typedef)
    <886>   DW_AT_name        : (indirect string, offset: 0xe05e4): DMA_TypeDef
    <88a>   DW_AT_decl_file   : 6
    <88b>   DW_AT_decl_line   : 376
    <88d>   DW_AT_decl_column : 3
    <88e>   DW_AT_type        : <0x85e>
 <1><892>: Abbrev Number: 22 (DW_TAG_structure_type)
    <893>   DW_AT_byte_size   : 44
    <894>   DW_AT_decl_file   : 6
    <895>   DW_AT_decl_line   : 455
    <897>   DW_AT_decl_column : 9
    <898>   DW_AT_sibling     : <0x929>
 <2><89c>: Abbrev Number: 10 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0xdebe7): MODER
    <8a1>   DW_AT_decl_file   : 6
    <8a2>   DW_AT_decl_line   : 457
    <8a4>   DW_AT_decl_column : 17
    <8a5>   DW_AT_type        : <0x16c>
    <8a9>   DW_AT_data_member_location: 0
 <2><8aa>: Abbrev Number: 10 (DW_TAG_member)
    <8ab>   DW_AT_name        : (indirect string, offset: 0xe2238): OTYPER
    <8af>   DW_AT_decl_file   : 6
    <8b0>   DW_AT_decl_line   : 458
    <8b2>   DW_AT_decl_column : 17
    <8b3>   DW_AT_type        : <0x16c>
    <8b7>   DW_AT_data_member_location: 4
 <2><8b8>: Abbrev Number: 10 (DW_TAG_member)
    <8b9>   DW_AT_name        : (indirect string, offset: 0xe299f): OSPEEDR
    <8bd>   DW_AT_decl_file   : 6
    <8be>   DW_AT_decl_line   : 459
    <8c0>   DW_AT_decl_column : 17
    <8c1>   DW_AT_type        : <0x16c>
    <8c5>   DW_AT_data_member_location: 8
 <2><8c6>: Abbrev Number: 10 (DW_TAG_member)
    <8c7>   DW_AT_name        : (indirect string, offset: 0xe1a22): PUPDR
    <8cb>   DW_AT_decl_file   : 6
    <8cc>   DW_AT_decl_line   : 460
    <8ce>   DW_AT_decl_column : 17
    <8cf>   DW_AT_type        : <0x16c>
    <8d3>   DW_AT_data_member_location: 12
 <2><8d4>: Abbrev Number: 21 (DW_TAG_member)
    <8d5>   DW_AT_name        : IDR
    <8d9>   DW_AT_decl_file   : 6
    <8da>   DW_AT_decl_line   : 461
    <8dc>   DW_AT_decl_column : 17
    <8dd>   DW_AT_type        : <0x16c>
    <8e1>   DW_AT_data_member_location: 16
 <2><8e2>: Abbrev Number: 21 (DW_TAG_member)
    <8e3>   DW_AT_name        : ODR
    <8e7>   DW_AT_decl_file   : 6
    <8e8>   DW_AT_decl_line   : 462
    <8ea>   DW_AT_decl_column : 17
    <8eb>   DW_AT_type        : <0x16c>
    <8ef>   DW_AT_data_member_location: 20
 <2><8f0>: Abbrev Number: 10 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0xe19c0): BSRR
    <8f5>   DW_AT_decl_file   : 6
    <8f6>   DW_AT_decl_line   : 463
    <8f8>   DW_AT_decl_column : 17
    <8f9>   DW_AT_type        : <0x16c>
    <8fd>   DW_AT_data_member_location: 24
 <2><8fe>: Abbrev Number: 10 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0xe2914): LCKR
    <903>   DW_AT_decl_file   : 6
    <904>   DW_AT_decl_line   : 464
    <906>   DW_AT_decl_column : 17
    <907>   DW_AT_type        : <0x16c>
    <90b>   DW_AT_data_member_location: 28
 <2><90c>: Abbrev Number: 21 (DW_TAG_member)
    <90d>   DW_AT_name        : AFR
    <911>   DW_AT_decl_file   : 6
    <912>   DW_AT_decl_line   : 465
    <914>   DW_AT_decl_column : 17
    <915>   DW_AT_type        : <0x939>
    <919>   DW_AT_data_member_location: 32
 <2><91a>: Abbrev Number: 21 (DW_TAG_member)
    <91b>   DW_AT_name        : BRR
    <91f>   DW_AT_decl_file   : 6
    <920>   DW_AT_decl_line   : 466
    <922>   DW_AT_decl_column : 17
    <923>   DW_AT_type        : <0x16c>
    <927>   DW_AT_data_member_location: 40
 <2><928>: Abbrev Number: 0
 <1><929>: Abbrev Number: 13 (DW_TAG_array_type)
    <92a>   DW_AT_type        : <0x16c>
    <92e>   DW_AT_sibling     : <0x939>
 <2><932>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <933>   DW_AT_type        : <0x132>
    <937>   DW_AT_upper_bound : 1
 <2><938>: Abbrev Number: 0
 <1><939>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <93a>   DW_AT_type        : <0x929>
 <1><93e>: Abbrev Number: 16 (DW_TAG_typedef)
    <93f>   DW_AT_name        : (indirect string, offset: 0xe30a0): GPIO_TypeDef
    <943>   DW_AT_decl_file   : 6
    <944>   DW_AT_decl_line   : 468
    <946>   DW_AT_decl_column : 3
    <947>   DW_AT_type        : <0x892>
 <1><94b>: Abbrev Number: 22 (DW_TAG_structure_type)
    <94c>   DW_AT_byte_size   : 156
    <94d>   DW_AT_decl_file   : 6
    <94e>   DW_AT_decl_line   : 594
    <950>   DW_AT_decl_column : 9
    <951>   DW_AT_sibling     : <0xb77>
 <2><955>: Abbrev Number: 21 (DW_TAG_member)
    <956>   DW_AT_name        : CR
    <959>   DW_AT_decl_file   : 6
    <95a>   DW_AT_decl_line   : 596
    <95c>   DW_AT_decl_column : 17
    <95d>   DW_AT_type        : <0x16c>
    <961>   DW_AT_data_member_location: 0
 <2><962>: Abbrev Number: 10 (DW_TAG_member)
    <963>   DW_AT_name        : (indirect string, offset: 0xe1c4c): ICSCR
    <967>   DW_AT_decl_file   : 6
    <968>   DW_AT_decl_line   : 597
    <96a>   DW_AT_decl_column : 17
    <96b>   DW_AT_type        : <0x16c>
    <96f>   DW_AT_data_member_location: 4
 <2><970>: Abbrev Number: 10 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0xe049b): CFGR
    <975>   DW_AT_decl_file   : 6
    <976>   DW_AT_decl_line   : 598
    <978>   DW_AT_decl_column : 17
    <979>   DW_AT_type        : <0x16c>
    <97d>   DW_AT_data_member_location: 8
 <2><97e>: Abbrev Number: 10 (DW_TAG_member)
    <97f>   DW_AT_name        : (indirect string, offset: 0xe1e21): PLLCFGR
    <983>   DW_AT_decl_file   : 6
    <984>   DW_AT_decl_line   : 599
    <986>   DW_AT_decl_column : 17
    <987>   DW_AT_type        : <0x16c>
    <98b>   DW_AT_data_member_location: 12
 <2><98c>: Abbrev Number: 10 (DW_TAG_member)
    <98d>   DW_AT_name        : (indirect string, offset: 0xe0494): PLLSAI1CFGR
    <991>   DW_AT_decl_file   : 6
    <992>   DW_AT_decl_line   : 600
    <994>   DW_AT_decl_column : 17
    <995>   DW_AT_type        : <0x16c>
    <999>   DW_AT_data_member_location: 16
 <2><99a>: Abbrev Number: 10 (DW_TAG_member)
    <99b>   DW_AT_name        : (indirect string, offset: 0x859de): RESERVED
    <99f>   DW_AT_decl_file   : 6
    <9a0>   DW_AT_decl_line   : 601
    <9a2>   DW_AT_decl_column : 17
    <9a3>   DW_AT_type        : <0x160>
    <9a7>   DW_AT_data_member_location: 20
 <2><9a8>: Abbrev Number: 10 (DW_TAG_member)
    <9a9>   DW_AT_name        : (indirect string, offset: 0xdec28): CIER
    <9ad>   DW_AT_decl_file   : 6
    <9ae>   DW_AT_decl_line   : 602
    <9b0>   DW_AT_decl_column : 17
    <9b1>   DW_AT_type        : <0x16c>
    <9b5>   DW_AT_data_member_location: 24
 <2><9b6>: Abbrev Number: 10 (DW_TAG_member)
    <9b7>   DW_AT_name        : (indirect string, offset: 0xdec2d): CIFR
    <9bb>   DW_AT_decl_file   : 6
    <9bc>   DW_AT_decl_line   : 603
    <9be>   DW_AT_decl_column : 17
    <9bf>   DW_AT_type        : <0x16c>
    <9c3>   DW_AT_data_member_location: 28
 <2><9c4>: Abbrev Number: 10 (DW_TAG_member)
    <9c5>   DW_AT_name        : (indirect string, offset: 0xdebed): CICR
    <9c9>   DW_AT_decl_file   : 6
    <9ca>   DW_AT_decl_line   : 604
    <9cc>   DW_AT_decl_column : 17
    <9cd>   DW_AT_type        : <0x16c>
    <9d1>   DW_AT_data_member_location: 32
 <2><9d2>: Abbrev Number: 10 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0xe2e9a): RESERVED0
    <9d7>   DW_AT_decl_file   : 6
    <9d8>   DW_AT_decl_line   : 605
    <9da>   DW_AT_decl_column : 17
    <9db>   DW_AT_type        : <0x160>
    <9df>   DW_AT_data_member_location: 36
 <2><9e0>: Abbrev Number: 10 (DW_TAG_member)
    <9e1>   DW_AT_name        : (indirect string, offset: 0xe2399): AHB1RSTR
    <9e5>   DW_AT_decl_file   : 6
    <9e6>   DW_AT_decl_line   : 606
    <9e8>   DW_AT_decl_column : 17
    <9e9>   DW_AT_type        : <0x16c>
    <9ed>   DW_AT_data_member_location: 40
 <2><9ee>: Abbrev Number: 10 (DW_TAG_member)
    <9ef>   DW_AT_name        : (indirect string, offset: 0xdf89b): AHB2RSTR
    <9f3>   DW_AT_decl_file   : 6
    <9f4>   DW_AT_decl_line   : 607
    <9f6>   DW_AT_decl_column : 17
    <9f7>   DW_AT_type        : <0x16c>
    <9fb>   DW_AT_data_member_location: 44
 <2><9fc>: Abbrev Number: 10 (DW_TAG_member)
    <9fd>   DW_AT_name        : (indirect string, offset: 0xe09ed): AHB3RSTR
    <a01>   DW_AT_decl_file   : 6
    <a02>   DW_AT_decl_line   : 608
    <a04>   DW_AT_decl_column : 17
    <a05>   DW_AT_type        : <0x16c>
    <a09>   DW_AT_data_member_location: 48
 <2><a0a>: Abbrev Number: 10 (DW_TAG_member)
    <a0b>   DW_AT_name        : (indirect string, offset: 0xe2ea4): RESERVED1
    <a0f>   DW_AT_decl_file   : 6
    <a10>   DW_AT_decl_line   : 609
    <a12>   DW_AT_decl_column : 17
    <a13>   DW_AT_type        : <0x160>
    <a17>   DW_AT_data_member_location: 52
 <2><a18>: Abbrev Number: 10 (DW_TAG_member)
    <a19>   DW_AT_name        : (indirect string, offset: 0xdfa71): APB1RSTR1
    <a1d>   DW_AT_decl_file   : 6
    <a1e>   DW_AT_decl_line   : 610
    <a20>   DW_AT_decl_column : 17
    <a21>   DW_AT_type        : <0x16c>
    <a25>   DW_AT_data_member_location: 56
 <2><a26>: Abbrev Number: 10 (DW_TAG_member)
    <a27>   DW_AT_name        : (indirect string, offset: 0xdfa7b): APB1RSTR2
    <a2b>   DW_AT_decl_file   : 6
    <a2c>   DW_AT_decl_line   : 611
    <a2e>   DW_AT_decl_column : 17
    <a2f>   DW_AT_type        : <0x16c>
    <a33>   DW_AT_data_member_location: 60
 <2><a34>: Abbrev Number: 10 (DW_TAG_member)
    <a35>   DW_AT_name        : (indirect string, offset: 0xe09ab): APB2RSTR
    <a39>   DW_AT_decl_file   : 6
    <a3a>   DW_AT_decl_line   : 612
    <a3c>   DW_AT_decl_column : 17
    <a3d>   DW_AT_type        : <0x16c>
    <a41>   DW_AT_data_member_location: 64
 <2><a42>: Abbrev Number: 10 (DW_TAG_member)
    <a43>   DW_AT_name        : (indirect string, offset: 0xe2eae): RESERVED2
    <a47>   DW_AT_decl_file   : 6
    <a48>   DW_AT_decl_line   : 613
    <a4a>   DW_AT_decl_column : 17
    <a4b>   DW_AT_type        : <0x160>
    <a4f>   DW_AT_data_member_location: 68
 <2><a50>: Abbrev Number: 10 (DW_TAG_member)
    <a51>   DW_AT_name        : (indirect string, offset: 0xdf06b): AHB1ENR
    <a55>   DW_AT_decl_file   : 6
    <a56>   DW_AT_decl_line   : 614
    <a58>   DW_AT_decl_column : 17
    <a59>   DW_AT_type        : <0x16c>
    <a5d>   DW_AT_data_member_location: 72
 <2><a5e>: Abbrev Number: 10 (DW_TAG_member)
    <a5f>   DW_AT_name        : (indirect string, offset: 0xdede2): AHB2ENR
    <a63>   DW_AT_decl_file   : 6
    <a64>   DW_AT_decl_line   : 615
    <a66>   DW_AT_decl_column : 17
    <a67>   DW_AT_type        : <0x16c>
    <a6b>   DW_AT_data_member_location: 76
 <2><a6c>: Abbrev Number: 10 (DW_TAG_member)
    <a6d>   DW_AT_name        : (indirect string, offset: 0xe0b12): AHB3ENR
    <a71>   DW_AT_decl_file   : 6
    <a72>   DW_AT_decl_line   : 616
    <a74>   DW_AT_decl_column : 17
    <a75>   DW_AT_type        : <0x16c>
    <a79>   DW_AT_data_member_location: 80
 <2><a7a>: Abbrev Number: 10 (DW_TAG_member)
    <a7b>   DW_AT_name        : (indirect string, offset: 0xe2eb8): RESERVED3
    <a7f>   DW_AT_decl_file   : 6
    <a80>   DW_AT_decl_line   : 617
    <a82>   DW_AT_decl_column : 17
    <a83>   DW_AT_type        : <0x160>
    <a87>   DW_AT_data_member_location: 84
 <2><a88>: Abbrev Number: 10 (DW_TAG_member)
    <a89>   DW_AT_name        : (indirect string, offset: 0xdee29): APB1ENR1
    <a8d>   DW_AT_decl_file   : 6
    <a8e>   DW_AT_decl_line   : 618
    <a90>   DW_AT_decl_column : 17
    <a91>   DW_AT_type        : <0x16c>
    <a95>   DW_AT_data_member_location: 88
 <2><a96>: Abbrev Number: 10 (DW_TAG_member)
    <a97>   DW_AT_name        : (indirect string, offset: 0xdee32): APB1ENR2
    <a9b>   DW_AT_decl_file   : 6
    <a9c>   DW_AT_decl_line   : 619
    <a9e>   DW_AT_decl_column : 17
    <a9f>   DW_AT_type        : <0x16c>
    <aa3>   DW_AT_data_member_location: 92
 <2><aa4>: Abbrev Number: 10 (DW_TAG_member)
    <aa5>   DW_AT_name        : (indirect string, offset: 0xdf2c1): APB2ENR
    <aa9>   DW_AT_decl_file   : 6
    <aaa>   DW_AT_decl_line   : 620
    <aac>   DW_AT_decl_column : 17
    <aad>   DW_AT_type        : <0x16c>
    <ab1>   DW_AT_data_member_location: 96
 <2><ab2>: Abbrev Number: 10 (DW_TAG_member)
    <ab3>   DW_AT_name        : (indirect string, offset: 0xe1606): RESERVED4
    <ab7>   DW_AT_decl_file   : 6
    <ab8>   DW_AT_decl_line   : 621
    <aba>   DW_AT_decl_column : 17
    <abb>   DW_AT_type        : <0x160>
    <abf>   DW_AT_data_member_location: 100
 <2><ac0>: Abbrev Number: 10 (DW_TAG_member)
    <ac1>   DW_AT_name        : (indirect string, offset: 0xe0bbe): AHB1SMENR
    <ac5>   DW_AT_decl_file   : 6
    <ac6>   DW_AT_decl_line   : 622
    <ac8>   DW_AT_decl_column : 17
    <ac9>   DW_AT_type        : <0x16c>
    <acd>   DW_AT_data_member_location: 104
 <2><ace>: Abbrev Number: 10 (DW_TAG_member)
    <acf>   DW_AT_name        : (indirect string, offset: 0xe2cf0): AHB2SMENR
    <ad3>   DW_AT_decl_file   : 6
    <ad4>   DW_AT_decl_line   : 623
    <ad6>   DW_AT_decl_column : 17
    <ad7>   DW_AT_type        : <0x16c>
    <adb>   DW_AT_data_member_location: 108
 <2><adc>: Abbrev Number: 10 (DW_TAG_member)
    <add>   DW_AT_name        : (indirect string, offset: 0xe05f0): AHB3SMENR
    <ae1>   DW_AT_decl_file   : 6
    <ae2>   DW_AT_decl_line   : 624
    <ae4>   DW_AT_decl_column : 17
    <ae5>   DW_AT_type        : <0x16c>
    <ae9>   DW_AT_data_member_location: 112
 <2><aea>: Abbrev Number: 10 (DW_TAG_member)
    <aeb>   DW_AT_name        : (indirect string, offset: 0xe2ec2): RESERVED5
    <aef>   DW_AT_decl_file   : 6
    <af0>   DW_AT_decl_line   : 625
    <af2>   DW_AT_decl_column : 17
    <af3>   DW_AT_type        : <0x160>
    <af7>   DW_AT_data_member_location: 116
 <2><af8>: Abbrev Number: 10 (DW_TAG_member)
    <af9>   DW_AT_name        : (indirect string, offset: 0xdee63): APB1SMENR1
    <afd>   DW_AT_decl_file   : 6
    <afe>   DW_AT_decl_line   : 626
    <b00>   DW_AT_decl_column : 17
    <b01>   DW_AT_type        : <0x16c>
    <b05>   DW_AT_data_member_location: 120
 <2><b06>: Abbrev Number: 10 (DW_TAG_member)
    <b07>   DW_AT_name        : (indirect string, offset: 0xdee6e): APB1SMENR2
    <b0b>   DW_AT_decl_file   : 6
    <b0c>   DW_AT_decl_line   : 627
    <b0e>   DW_AT_decl_column : 17
    <b0f>   DW_AT_type        : <0x16c>
    <b13>   DW_AT_data_member_location: 124
 <2><b14>: Abbrev Number: 10 (DW_TAG_member)
    <b15>   DW_AT_name        : (indirect string, offset: 0xe2416): APB2SMENR
    <b19>   DW_AT_decl_file   : 6
    <b1a>   DW_AT_decl_line   : 628
    <b1c>   DW_AT_decl_column : 17
    <b1d>   DW_AT_type        : <0x16c>
    <b21>   DW_AT_data_member_location: 128
 <2><b22>: Abbrev Number: 10 (DW_TAG_member)
    <b23>   DW_AT_name        : (indirect string, offset: 0xe2ecc): RESERVED6
    <b27>   DW_AT_decl_file   : 6
    <b28>   DW_AT_decl_line   : 629
    <b2a>   DW_AT_decl_column : 17
    <b2b>   DW_AT_type        : <0x160>
    <b2f>   DW_AT_data_member_location: 132
 <2><b30>: Abbrev Number: 10 (DW_TAG_member)
    <b31>   DW_AT_name        : (indirect string, offset: 0xe0310): CCIPR
    <b35>   DW_AT_decl_file   : 6
    <b36>   DW_AT_decl_line   : 630
    <b38>   DW_AT_decl_column : 17
    <b39>   DW_AT_type        : <0x16c>
    <b3d>   DW_AT_data_member_location: 136
 <2><b3e>: Abbrev Number: 10 (DW_TAG_member)
    <b3f>   DW_AT_name        : (indirect string, offset: 0xe2ed6): RESERVED7
    <b43>   DW_AT_decl_file   : 6
    <b44>   DW_AT_decl_line   : 631
    <b46>   DW_AT_decl_column : 17
    <b47>   DW_AT_type        : <0x160>
    <b4b>   DW_AT_data_member_location: 140
 <2><b4c>: Abbrev Number: 10 (DW_TAG_member)
    <b4d>   DW_AT_name        : (indirect string, offset: 0xdff13): BDCR
    <b51>   DW_AT_decl_file   : 6
    <b52>   DW_AT_decl_line   : 632
    <b54>   DW_AT_decl_column : 17
    <b55>   DW_AT_type        : <0x16c>
    <b59>   DW_AT_data_member_location: 144
 <2><b5a>: Abbrev Number: 21 (DW_TAG_member)
    <b5b>   DW_AT_name        : CSR
    <b5f>   DW_AT_decl_file   : 6
    <b60>   DW_AT_decl_line   : 633
    <b62>   DW_AT_decl_column : 17
    <b63>   DW_AT_type        : <0x16c>
    <b67>   DW_AT_data_member_location: 148
 <2><b68>: Abbrev Number: 10 (DW_TAG_member)
    <b69>   DW_AT_name        : (indirect string, offset: 0xdfff0): CRRCR
    <b6d>   DW_AT_decl_file   : 6
    <b6e>   DW_AT_decl_line   : 634
    <b70>   DW_AT_decl_column : 17
    <b71>   DW_AT_type        : <0x16c>
    <b75>   DW_AT_data_member_location: 152
 <2><b76>: Abbrev Number: 0
 <1><b77>: Abbrev Number: 16 (DW_TAG_typedef)
    <b78>   DW_AT_name        : (indirect string, offset: 0xe0c05): RCC_TypeDef
    <b7c>   DW_AT_decl_file   : 6
    <b7d>   DW_AT_decl_line   : 635
    <b7f>   DW_AT_decl_column : 3
    <b80>   DW_AT_type        : <0x94b>
 <1><b84>: Abbrev Number: 22 (DW_TAG_structure_type)
    <b85>   DW_AT_byte_size   : 104
    <b86>   DW_AT_decl_file   : 6
    <b87>   DW_AT_decl_line   : 803
    <b89>   DW_AT_decl_column : 9
    <b8a>   DW_AT_sibling     : <0xcfa>
 <2><b8e>: Abbrev Number: 21 (DW_TAG_member)
    <b8f>   DW_AT_name        : CR1
    <b93>   DW_AT_decl_file   : 6
    <b94>   DW_AT_decl_line   : 805
    <b96>   DW_AT_decl_column : 17
    <b97>   DW_AT_type        : <0x16c>
    <b9b>   DW_AT_data_member_location: 0
 <2><b9c>: Abbrev Number: 21 (DW_TAG_member)
    <b9d>   DW_AT_name        : CR2
    <ba1>   DW_AT_decl_file   : 6
    <ba2>   DW_AT_decl_line   : 806
    <ba4>   DW_AT_decl_column : 17
    <ba5>   DW_AT_type        : <0x16c>
    <ba9>   DW_AT_data_member_location: 4
 <2><baa>: Abbrev Number: 10 (DW_TAG_member)
    <bab>   DW_AT_name        : (indirect string, offset: 0x59bd): SMCR
    <baf>   DW_AT_decl_file   : 6
    <bb0>   DW_AT_decl_line   : 807
    <bb2>   DW_AT_decl_column : 17
    <bb3>   DW_AT_type        : <0x16c>
    <bb7>   DW_AT_data_member_location: 8
 <2><bb8>: Abbrev Number: 10 (DW_TAG_member)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x4611e): DIER
    <bbd>   DW_AT_decl_file   : 6
    <bbe>   DW_AT_decl_line   : 808
    <bc0>   DW_AT_decl_column : 17
    <bc1>   DW_AT_type        : <0x16c>
    <bc5>   DW_AT_data_member_location: 12
 <2><bc6>: Abbrev Number: 21 (DW_TAG_member)
    <bc7>   DW_AT_name        : SR
    <bca>   DW_AT_decl_file   : 6
    <bcb>   DW_AT_decl_line   : 809
    <bcd>   DW_AT_decl_column : 17
    <bce>   DW_AT_type        : <0x16c>
    <bd2>   DW_AT_data_member_location: 16
 <2><bd3>: Abbrev Number: 21 (DW_TAG_member)
    <bd4>   DW_AT_name        : EGR
    <bd8>   DW_AT_decl_file   : 6
    <bd9>   DW_AT_decl_line   : 810
    <bdb>   DW_AT_decl_column : 17
    <bdc>   DW_AT_type        : <0x16c>
    <be0>   DW_AT_data_member_location: 20
 <2><be1>: Abbrev Number: 10 (DW_TAG_member)
    <be2>   DW_AT_name        : (indirect string, offset: 0x79801): CCMR1
    <be6>   DW_AT_decl_file   : 6
    <be7>   DW_AT_decl_line   : 811
    <be9>   DW_AT_decl_column : 17
    <bea>   DW_AT_type        : <0x16c>
    <bee>   DW_AT_data_member_location: 24
 <2><bef>: Abbrev Number: 10 (DW_TAG_member)
    <bf0>   DW_AT_name        : (indirect string, offset: 0x5717b): CCMR2
    <bf4>   DW_AT_decl_file   : 6
    <bf5>   DW_AT_decl_line   : 812
    <bf7>   DW_AT_decl_column : 17
    <bf8>   DW_AT_type        : <0x16c>
    <bfc>   DW_AT_data_member_location: 28
 <2><bfd>: Abbrev Number: 10 (DW_TAG_member)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x34e05): CCER
    <c02>   DW_AT_decl_file   : 6
    <c03>   DW_AT_decl_line   : 813
    <c05>   DW_AT_decl_column : 17
    <c06>   DW_AT_type        : <0x16c>
    <c0a>   DW_AT_data_member_location: 32
 <2><c0b>: Abbrev Number: 21 (DW_TAG_member)
    <c0c>   DW_AT_name        : CNT
    <c10>   DW_AT_decl_file   : 6
    <c11>   DW_AT_decl_line   : 814
    <c13>   DW_AT_decl_column : 17
    <c14>   DW_AT_type        : <0x16c>
    <c18>   DW_AT_data_member_location: 36
 <2><c19>: Abbrev Number: 21 (DW_TAG_member)
    <c1a>   DW_AT_name        : PSC
    <c1e>   DW_AT_decl_file   : 6
    <c1f>   DW_AT_decl_line   : 815
    <c21>   DW_AT_decl_column : 17
    <c22>   DW_AT_type        : <0x16c>
    <c26>   DW_AT_data_member_location: 40
 <2><c27>: Abbrev Number: 21 (DW_TAG_member)
    <c28>   DW_AT_name        : ARR
    <c2c>   DW_AT_decl_file   : 6
    <c2d>   DW_AT_decl_line   : 816
    <c2f>   DW_AT_decl_column : 17
    <c30>   DW_AT_type        : <0x16c>
    <c34>   DW_AT_data_member_location: 44
 <2><c35>: Abbrev Number: 21 (DW_TAG_member)
    <c36>   DW_AT_name        : RCR
    <c3a>   DW_AT_decl_file   : 6
    <c3b>   DW_AT_decl_line   : 817
    <c3d>   DW_AT_decl_column : 17
    <c3e>   DW_AT_type        : <0x16c>
    <c42>   DW_AT_data_member_location: 48
 <2><c43>: Abbrev Number: 10 (DW_TAG_member)
    <c44>   DW_AT_name        : (indirect string, offset: 0x1a452): CCR1
    <c48>   DW_AT_decl_file   : 6
    <c49>   DW_AT_decl_line   : 818
    <c4b>   DW_AT_decl_column : 17
    <c4c>   DW_AT_type        : <0x16c>
    <c50>   DW_AT_data_member_location: 52
 <2><c51>: Abbrev Number: 10 (DW_TAG_member)
    <c52>   DW_AT_name        : (indirect string, offset: 0x5b8f6): CCR2
    <c56>   DW_AT_decl_file   : 6
    <c57>   DW_AT_decl_line   : 819
    <c59>   DW_AT_decl_column : 17
    <c5a>   DW_AT_type        : <0x16c>
    <c5e>   DW_AT_data_member_location: 56
 <2><c5f>: Abbrev Number: 10 (DW_TAG_member)
    <c60>   DW_AT_name        : (indirect string, offset: 0x3e489): CCR3
    <c64>   DW_AT_decl_file   : 6
    <c65>   DW_AT_decl_line   : 820
    <c67>   DW_AT_decl_column : 17
    <c68>   DW_AT_type        : <0x16c>
    <c6c>   DW_AT_data_member_location: 60
 <2><c6d>: Abbrev Number: 10 (DW_TAG_member)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xdf2b): CCR4
    <c72>   DW_AT_decl_file   : 6
    <c73>   DW_AT_decl_line   : 821
    <c75>   DW_AT_decl_column : 17
    <c76>   DW_AT_type        : <0x16c>
    <c7a>   DW_AT_data_member_location: 64
 <2><c7b>: Abbrev Number: 10 (DW_TAG_member)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x651c5): BDTR
    <c80>   DW_AT_decl_file   : 6
    <c81>   DW_AT_decl_line   : 822
    <c83>   DW_AT_decl_column : 17
    <c84>   DW_AT_type        : <0x16c>
    <c88>   DW_AT_data_member_location: 68
 <2><c89>: Abbrev Number: 21 (DW_TAG_member)
    <c8a>   DW_AT_name        : DCR
    <c8e>   DW_AT_decl_file   : 6
    <c8f>   DW_AT_decl_line   : 823
    <c91>   DW_AT_decl_column : 17
    <c92>   DW_AT_type        : <0x16c>
    <c96>   DW_AT_data_member_location: 72
 <2><c97>: Abbrev Number: 10 (DW_TAG_member)
    <c98>   DW_AT_name        : (indirect string, offset: 0xa40ed): DMAR
    <c9c>   DW_AT_decl_file   : 6
    <c9d>   DW_AT_decl_line   : 824
    <c9f>   DW_AT_decl_column : 17
    <ca0>   DW_AT_type        : <0x16c>
    <ca4>   DW_AT_data_member_location: 76
 <2><ca5>: Abbrev Number: 21 (DW_TAG_member)
    <ca6>   DW_AT_name        : OR1
    <caa>   DW_AT_decl_file   : 6
    <cab>   DW_AT_decl_line   : 825
    <cad>   DW_AT_decl_column : 17
    <cae>   DW_AT_type        : <0x16c>
    <cb2>   DW_AT_data_member_location: 80
 <2><cb3>: Abbrev Number: 10 (DW_TAG_member)
    <cb4>   DW_AT_name        : (indirect string, offset: 0xc5d8f): CCMR3
    <cb8>   DW_AT_decl_file   : 6
    <cb9>   DW_AT_decl_line   : 826
    <cbb>   DW_AT_decl_column : 17
    <cbc>   DW_AT_type        : <0x16c>
    <cc0>   DW_AT_data_member_location: 84
 <2><cc1>: Abbrev Number: 10 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x26ffc): CCR5
    <cc6>   DW_AT_decl_file   : 6
    <cc7>   DW_AT_decl_line   : 827
    <cc9>   DW_AT_decl_column : 17
    <cca>   DW_AT_type        : <0x16c>
    <cce>   DW_AT_data_member_location: 88
 <2><ccf>: Abbrev Number: 10 (DW_TAG_member)
    <cd0>   DW_AT_name        : (indirect string, offset: 0x9c67b): CCR6
    <cd4>   DW_AT_decl_file   : 6
    <cd5>   DW_AT_decl_line   : 828
    <cd7>   DW_AT_decl_column : 17
    <cd8>   DW_AT_type        : <0x16c>
    <cdc>   DW_AT_data_member_location: 92
 <2><cdd>: Abbrev Number: 21 (DW_TAG_member)
    <cde>   DW_AT_name        : OR2
    <ce2>   DW_AT_decl_file   : 6
    <ce3>   DW_AT_decl_line   : 829
    <ce5>   DW_AT_decl_column : 17
    <ce6>   DW_AT_type        : <0x16c>
    <cea>   DW_AT_data_member_location: 96
 <2><ceb>: Abbrev Number: 21 (DW_TAG_member)
    <cec>   DW_AT_name        : OR3
    <cf0>   DW_AT_decl_file   : 6
    <cf1>   DW_AT_decl_line   : 830
    <cf3>   DW_AT_decl_column : 17
    <cf4>   DW_AT_type        : <0x16c>
    <cf8>   DW_AT_data_member_location: 100
 <2><cf9>: Abbrev Number: 0
 <1><cfa>: Abbrev Number: 16 (DW_TAG_typedef)
    <cfb>   DW_AT_name        : (indirect string, offset: 0xe2f17): TIM_TypeDef
    <cff>   DW_AT_decl_file   : 6
    <d00>   DW_AT_decl_line   : 831
    <d02>   DW_AT_decl_column : 3
    <d03>   DW_AT_type        : <0xb84>
 <1><d07>: Abbrev Number: 22 (DW_TAG_structure_type)
    <d08>   DW_AT_byte_size   : 44
    <d09>   DW_AT_decl_file   : 6
    <d0a>   DW_AT_decl_line   : 860
    <d0c>   DW_AT_decl_column : 9
    <d0d>   DW_AT_sibling     : <0xde4>
 <2><d11>: Abbrev Number: 21 (DW_TAG_member)
    <d12>   DW_AT_name        : CR1
    <d16>   DW_AT_decl_file   : 6
    <d17>   DW_AT_decl_line   : 862
    <d19>   DW_AT_decl_column : 17
    <d1a>   DW_AT_type        : <0x16c>
    <d1e>   DW_AT_data_member_location: 0
 <2><d1f>: Abbrev Number: 21 (DW_TAG_member)
    <d20>   DW_AT_name        : CR2
    <d24>   DW_AT_decl_file   : 6
    <d25>   DW_AT_decl_line   : 863
    <d27>   DW_AT_decl_column : 17
    <d28>   DW_AT_type        : <0x16c>
    <d2c>   DW_AT_data_member_location: 4
 <2><d2d>: Abbrev Number: 21 (DW_TAG_member)
    <d2e>   DW_AT_name        : CR3
    <d32>   DW_AT_decl_file   : 6
    <d33>   DW_AT_decl_line   : 864
    <d35>   DW_AT_decl_column : 17
    <d36>   DW_AT_type        : <0x16c>
    <d3a>   DW_AT_data_member_location: 8
 <2><d3b>: Abbrev Number: 21 (DW_TAG_member)
    <d3c>   DW_AT_name        : BRR
    <d40>   DW_AT_decl_file   : 6
    <d41>   DW_AT_decl_line   : 865
    <d43>   DW_AT_decl_column : 17
    <d44>   DW_AT_type        : <0x16c>
    <d48>   DW_AT_data_member_location: 12
 <2><d49>: Abbrev Number: 10 (DW_TAG_member)
    <d4a>   DW_AT_name        : (indirect string, offset: 0xe0076): GTPR
    <d4e>   DW_AT_decl_file   : 6
    <d4f>   DW_AT_decl_line   : 866
    <d51>   DW_AT_decl_column : 17
    <d52>   DW_AT_type        : <0x15b>
    <d56>   DW_AT_data_member_location: 16
 <2><d57>: Abbrev Number: 10 (DW_TAG_member)
    <d58>   DW_AT_name        : (indirect string, offset: 0xe2eae): RESERVED2
    <d5c>   DW_AT_decl_file   : 6
    <d5d>   DW_AT_decl_line   : 867
    <d5f>   DW_AT_decl_column : 13
    <d60>   DW_AT_type        : <0x14f>
    <d64>   DW_AT_data_member_location: 18
 <2><d65>: Abbrev Number: 10 (DW_TAG_member)
    <d66>   DW_AT_name        : (indirect string, offset: 0xe15e8): RTOR
    <d6a>   DW_AT_decl_file   : 6
    <d6b>   DW_AT_decl_line   : 868
    <d6d>   DW_AT_decl_column : 17
    <d6e>   DW_AT_type        : <0x16c>
    <d72>   DW_AT_data_member_location: 20
 <2><d73>: Abbrev Number: 21 (DW_TAG_member)
    <d74>   DW_AT_name        : RQR
    <d78>   DW_AT_decl_file   : 6
    <d79>   DW_AT_decl_line   : 869
    <d7b>   DW_AT_decl_column : 17
    <d7c>   DW_AT_type        : <0x15b>
    <d80>   DW_AT_data_member_location: 24
 <2><d81>: Abbrev Number: 10 (DW_TAG_member)
    <d82>   DW_AT_name        : (indirect string, offset: 0xe2eb8): RESERVED3
    <d86>   DW_AT_decl_file   : 6
    <d87>   DW_AT_decl_line   : 870
    <d89>   DW_AT_decl_column : 13
    <d8a>   DW_AT_type        : <0x14f>
    <d8e>   DW_AT_data_member_location: 26
 <2><d8f>: Abbrev Number: 21 (DW_TAG_member)
    <d90>   DW_AT_name        : ISR
    <d94>   DW_AT_decl_file   : 6
    <d95>   DW_AT_decl_line   : 871
    <d97>   DW_AT_decl_column : 17
    <d98>   DW_AT_type        : <0x16c>
    <d9c>   DW_AT_data_member_location: 28
 <2><d9d>: Abbrev Number: 21 (DW_TAG_member)
    <d9e>   DW_AT_name        : ICR
    <da2>   DW_AT_decl_file   : 6
    <da3>   DW_AT_decl_line   : 872
    <da5>   DW_AT_decl_column : 17
    <da6>   DW_AT_type        : <0x16c>
    <daa>   DW_AT_data_member_location: 32
 <2><dab>: Abbrev Number: 21 (DW_TAG_member)
    <dac>   DW_AT_name        : RDR
    <db0>   DW_AT_decl_file   : 6
    <db1>   DW_AT_decl_line   : 873
    <db3>   DW_AT_decl_column : 17
    <db4>   DW_AT_type        : <0x15b>
    <db8>   DW_AT_data_member_location: 36
 <2><db9>: Abbrev Number: 10 (DW_TAG_member)
    <dba>   DW_AT_name        : (indirect string, offset: 0xe1606): RESERVED4
    <dbe>   DW_AT_decl_file   : 6
    <dbf>   DW_AT_decl_line   : 874
    <dc1>   DW_AT_decl_column : 13
    <dc2>   DW_AT_type        : <0x14f>
    <dc6>   DW_AT_data_member_location: 38
 <2><dc7>: Abbrev Number: 21 (DW_TAG_member)
    <dc8>   DW_AT_name        : TDR
    <dcc>   DW_AT_decl_file   : 6
    <dcd>   DW_AT_decl_line   : 875
    <dcf>   DW_AT_decl_column : 17
    <dd0>   DW_AT_type        : <0x15b>
    <dd4>   DW_AT_data_member_location: 40
 <2><dd5>: Abbrev Number: 10 (DW_TAG_member)
    <dd6>   DW_AT_name        : (indirect string, offset: 0xe2ec2): RESERVED5
    <dda>   DW_AT_decl_file   : 6
    <ddb>   DW_AT_decl_line   : 876
    <ddd>   DW_AT_decl_column : 13
    <dde>   DW_AT_type        : <0x14f>
    <de2>   DW_AT_data_member_location: 42
 <2><de3>: Abbrev Number: 0
 <1><de4>: Abbrev Number: 16 (DW_TAG_typedef)
    <de5>   DW_AT_name        : (indirect string, offset: 0xe31c8): USART_TypeDef
    <de9>   DW_AT_decl_file   : 6
    <dea>   DW_AT_decl_line   : 877
    <dec>   DW_AT_decl_column : 3
    <ded>   DW_AT_type        : <0xd07>
 <1><df1>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <df2>   DW_AT_encoding    : 7	(unsigned)
    <df3>   DW_AT_byte_size   : 1
    <df4>   DW_AT_type        : <0xe2>
    <df8>   DW_AT_decl_file   : 7
    <df9>   DW_AT_decl_line   : 192
    <dfa>   DW_AT_decl_column : 1
    <dfb>   DW_AT_sibling     : <0xe0c>
 <2><dff>: Abbrev Number: 24 (DW_TAG_enumerator)
    <e00>   DW_AT_name        : (indirect string, offset: 0x2965e): DISABLE
    <e04>   DW_AT_const_value : 0
 <2><e05>: Abbrev Number: 24 (DW_TAG_enumerator)
    <e06>   DW_AT_name        : (indirect string, offset: 0x302b1): ENABLE
    <e0a>   DW_AT_const_value : 1
 <2><e0b>: Abbrev Number: 0
 <1><e0c>: Abbrev Number: 3 (DW_TAG_typedef)
    <e0d>   DW_AT_name        : (indirect string, offset: 0xe26ca): FunctionalState
    <e11>   DW_AT_decl_file   : 7
    <e12>   DW_AT_decl_line   : 195
    <e13>   DW_AT_decl_column : 3
    <e14>   DW_AT_type        : <0xdf1>
 <1><e18>: Abbrev Number: 2 (DW_TAG_base_type)
    <e19>   DW_AT_byte_size   : 8
    <e1a>   DW_AT_encoding    : 4	(float)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x145a6): long double
 <1><e1f>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <e20>   DW_AT_encoding    : 7	(unsigned)
    <e21>   DW_AT_byte_size   : 1
    <e22>   DW_AT_type        : <0xe2>
    <e26>   DW_AT_decl_file   : 8
    <e27>   DW_AT_decl_line   : 39
    <e28>   DW_AT_decl_column : 1
    <e29>   DW_AT_sibling     : <0xe46>
 <2><e2d>: Abbrev Number: 24 (DW_TAG_enumerator)
    <e2e>   DW_AT_name        : (indirect string, offset: 0xe04c6): HAL_OK
    <e32>   DW_AT_const_value : 0
 <2><e33>: Abbrev Number: 24 (DW_TAG_enumerator)
    <e34>   DW_AT_name        : (indirect string, offset: 0xe185a): HAL_ERROR
    <e38>   DW_AT_const_value : 1
 <2><e39>: Abbrev Number: 24 (DW_TAG_enumerator)
    <e3a>   DW_AT_name        : (indirect string, offset: 0xdf604): HAL_BUSY
    <e3e>   DW_AT_const_value : 2
 <2><e3f>: Abbrev Number: 24 (DW_TAG_enumerator)
    <e40>   DW_AT_name        : (indirect string, offset: 0xe018f): HAL_TIMEOUT
    <e44>   DW_AT_const_value : 3
 <2><e45>: Abbrev Number: 0
 <1><e46>: Abbrev Number: 3 (DW_TAG_typedef)
    <e47>   DW_AT_name        : (indirect string, offset: 0xdec06): HAL_StatusTypeDef
    <e4b>   DW_AT_decl_file   : 8
    <e4c>   DW_AT_decl_line   : 44
    <e4d>   DW_AT_decl_column : 3
    <e4e>   DW_AT_type        : <0xe1f>
 <1><e52>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <e53>   DW_AT_encoding    : 7	(unsigned)
    <e54>   DW_AT_byte_size   : 1
    <e55>   DW_AT_type        : <0xe2>
    <e59>   DW_AT_decl_file   : 8
    <e5a>   DW_AT_decl_line   : 50
    <e5b>   DW_AT_decl_column : 1
    <e5c>   DW_AT_sibling     : <0xe6d>
 <2><e60>: Abbrev Number: 24 (DW_TAG_enumerator)
    <e61>   DW_AT_name        : (indirect string, offset: 0xe1fd3): HAL_UNLOCKED
    <e65>   DW_AT_const_value : 0
 <2><e66>: Abbrev Number: 24 (DW_TAG_enumerator)
    <e67>   DW_AT_name        : (indirect string, offset: 0xe3441): HAL_LOCKED
    <e6b>   DW_AT_const_value : 1
 <2><e6c>: Abbrev Number: 0
 <1><e6d>: Abbrev Number: 3 (DW_TAG_typedef)
    <e6e>   DW_AT_name        : (indirect string, offset: 0xe15d8): HAL_LockTypeDef
    <e72>   DW_AT_decl_file   : 8
    <e73>   DW_AT_decl_line   : 53
    <e74>   DW_AT_decl_column : 3
    <e75>   DW_AT_type        : <0xe52>
 <1><e79>: Abbrev Number: 17 (DW_TAG_structure_type)
    <e7a>   DW_AT_byte_size   : 28
    <e7b>   DW_AT_decl_file   : 9
    <e7c>   DW_AT_decl_line   : 45
    <e7d>   DW_AT_decl_column : 9
    <e7e>   DW_AT_sibling     : <0xede>
 <2><e82>: Abbrev Number: 19 (DW_TAG_member)
    <e83>   DW_AT_name        : (indirect string, offset: 0xe1c1a): PLLState
    <e87>   DW_AT_decl_file   : 9
    <e88>   DW_AT_decl_line   : 47
    <e89>   DW_AT_decl_column : 12
    <e8a>   DW_AT_type        : <0x160>
    <e8e>   DW_AT_data_member_location: 0
 <2><e8f>: Abbrev Number: 19 (DW_TAG_member)
    <e90>   DW_AT_name        : (indirect string, offset: 0xe1da7): PLLSource
    <e94>   DW_AT_decl_file   : 9
    <e95>   DW_AT_decl_line   : 50
    <e96>   DW_AT_decl_column : 12
    <e97>   DW_AT_type        : <0x160>
    <e9b>   DW_AT_data_member_location: 4
 <2><e9c>: Abbrev Number: 19 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0xe1a28): PLLM
    <ea1>   DW_AT_decl_file   : 9
    <ea2>   DW_AT_decl_line   : 53
    <ea3>   DW_AT_decl_column : 12
    <ea4>   DW_AT_type        : <0x160>
    <ea8>   DW_AT_data_member_location: 8
 <2><ea9>: Abbrev Number: 19 (DW_TAG_member)
    <eaa>   DW_AT_name        : (indirect string, offset: 0xe2587): PLLN
    <eae>   DW_AT_decl_file   : 9
    <eaf>   DW_AT_decl_line   : 57
    <eb0>   DW_AT_decl_column : 12
    <eb1>   DW_AT_type        : <0x160>
    <eb5>   DW_AT_data_member_location: 12
 <2><eb6>: Abbrev Number: 19 (DW_TAG_member)
    <eb7>   DW_AT_name        : (indirect string, offset: 0xe258c): PLLP
    <ebb>   DW_AT_decl_file   : 9
    <ebc>   DW_AT_decl_line   : 61
    <ebd>   DW_AT_decl_column : 12
    <ebe>   DW_AT_type        : <0x160>
    <ec2>   DW_AT_data_member_location: 16
 <2><ec3>: Abbrev Number: 19 (DW_TAG_member)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x50e8f): PLLQ
    <ec8>   DW_AT_decl_file   : 9
    <ec9>   DW_AT_decl_line   : 65
    <eca>   DW_AT_decl_column : 12
    <ecb>   DW_AT_type        : <0x160>
    <ecf>   DW_AT_data_member_location: 20
 <2><ed0>: Abbrev Number: 19 (DW_TAG_member)
    <ed1>   DW_AT_name        : (indirect string, offset: 0xe2591): PLLR
    <ed5>   DW_AT_decl_file   : 9
    <ed6>   DW_AT_decl_line   : 68
    <ed7>   DW_AT_decl_column : 12
    <ed8>   DW_AT_type        : <0x160>
    <edc>   DW_AT_data_member_location: 24
 <2><edd>: Abbrev Number: 0
 <1><ede>: Abbrev Number: 3 (DW_TAG_typedef)
    <edf>   DW_AT_name        : (indirect string, offset: 0xe17a0): RCC_PLLInitTypeDef
    <ee3>   DW_AT_decl_file   : 9
    <ee4>   DW_AT_decl_line   : 73
    <ee5>   DW_AT_decl_column : 2
    <ee6>   DW_AT_type        : <0xe79>
 <1><eea>: Abbrev Number: 17 (DW_TAG_structure_type)
    <eeb>   DW_AT_byte_size   : 68
    <eec>   DW_AT_decl_file   : 9
    <eed>   DW_AT_decl_line   : 78
    <eee>   DW_AT_decl_column : 9
    <eef>   DW_AT_sibling     : <0xf83>
 <2><ef3>: Abbrev Number: 19 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0xe246a): OscillatorType
    <ef8>   DW_AT_decl_file   : 9
    <ef9>   DW_AT_decl_line   : 80
    <efa>   DW_AT_decl_column : 12
    <efb>   DW_AT_type        : <0x160>
    <eff>   DW_AT_data_member_location: 0
 <2><f00>: Abbrev Number: 19 (DW_TAG_member)
    <f01>   DW_AT_name        : (indirect string, offset: 0xe1c95): HSEState
    <f05>   DW_AT_decl_file   : 9
    <f06>   DW_AT_decl_line   : 83
    <f07>   DW_AT_decl_column : 12
    <f08>   DW_AT_type        : <0x160>
    <f0c>   DW_AT_data_member_location: 4
 <2><f0d>: Abbrev Number: 19 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0xe18fb): LSEState
    <f12>   DW_AT_decl_file   : 9
    <f13>   DW_AT_decl_line   : 86
    <f14>   DW_AT_decl_column : 12
    <f15>   DW_AT_type        : <0x160>
    <f19>   DW_AT_data_member_location: 8
 <2><f1a>: Abbrev Number: 19 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0xe0a38): HSIState
    <f1f>   DW_AT_decl_file   : 9
    <f20>   DW_AT_decl_line   : 89
    <f21>   DW_AT_decl_column : 12
    <f22>   DW_AT_type        : <0x160>
    <f26>   DW_AT_data_member_location: 12
 <2><f27>: Abbrev Number: 19 (DW_TAG_member)
    <f28>   DW_AT_name        : (indirect string, offset: 0xe2948): HSICalibrationValue
    <f2c>   DW_AT_decl_file   : 9
    <f2d>   DW_AT_decl_line   : 92
    <f2e>   DW_AT_decl_column : 12
    <f2f>   DW_AT_type        : <0x160>
    <f33>   DW_AT_data_member_location: 16
 <2><f34>: Abbrev Number: 19 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0xe0534): LSIState
    <f39>   DW_AT_decl_file   : 9
    <f3a>   DW_AT_decl_line   : 98
    <f3b>   DW_AT_decl_column : 12
    <f3c>   DW_AT_type        : <0x160>
    <f40>   DW_AT_data_member_location: 20
 <2><f41>: Abbrev Number: 19 (DW_TAG_member)
    <f42>   DW_AT_name        : (indirect string, offset: 0xe04cd): MSIState
    <f46>   DW_AT_decl_file   : 9
    <f47>   DW_AT_decl_line   : 106
    <f48>   DW_AT_decl_column : 12
    <f49>   DW_AT_type        : <0x160>
    <f4d>   DW_AT_data_member_location: 24
 <2><f4e>: Abbrev Number: 19 (DW_TAG_member)
    <f4f>   DW_AT_name        : (indirect string, offset: 0xe02d1): MSICalibrationValue
    <f53>   DW_AT_decl_file   : 9
    <f54>   DW_AT_decl_line   : 109
    <f55>   DW_AT_decl_column : 12
    <f56>   DW_AT_type        : <0x160>
    <f5a>   DW_AT_data_member_location: 28
 <2><f5b>: Abbrev Number: 19 (DW_TAG_member)
    <f5c>   DW_AT_name        : (indirect string, offset: 0xe0ea8): MSIClockRange
    <f60>   DW_AT_decl_file   : 9
    <f61>   DW_AT_decl_line   : 112
    <f62>   DW_AT_decl_column : 12
    <f63>   DW_AT_type        : <0x160>
    <f67>   DW_AT_data_member_location: 32
 <2><f68>: Abbrev Number: 19 (DW_TAG_member)
    <f69>   DW_AT_name        : (indirect string, offset: 0xe1eba): HSI48State
    <f6d>   DW_AT_decl_file   : 9
    <f6e>   DW_AT_decl_line   : 115
    <f6f>   DW_AT_decl_column : 12
    <f70>   DW_AT_type        : <0x160>
    <f74>   DW_AT_data_member_location: 36
 <2><f75>: Abbrev Number: 18 (DW_TAG_member)
    <f76>   DW_AT_name        : PLL
    <f7a>   DW_AT_decl_file   : 9
    <f7b>   DW_AT_decl_line   : 118
    <f7c>   DW_AT_decl_column : 22
    <f7d>   DW_AT_type        : <0xede>
    <f81>   DW_AT_data_member_location: 40
 <2><f82>: Abbrev Number: 0
 <1><f83>: Abbrev Number: 3 (DW_TAG_typedef)
    <f84>   DW_AT_name        : (indirect string, offset: 0xe111d): RCC_OscInitTypeDef
    <f88>   DW_AT_decl_file   : 9
    <f89>   DW_AT_decl_line   : 120
    <f8a>   DW_AT_decl_column : 2
    <f8b>   DW_AT_type        : <0xeea>
 <1><f8f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <f90>   DW_AT_byte_size   : 20
    <f91>   DW_AT_decl_file   : 9
    <f92>   DW_AT_decl_line   : 125
    <f93>   DW_AT_decl_column : 9
    <f94>   DW_AT_sibling     : <0xfda>
 <2><f98>: Abbrev Number: 19 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0xe0316): ClockType
    <f9d>   DW_AT_decl_file   : 9
    <f9e>   DW_AT_decl_line   : 127
    <f9f>   DW_AT_decl_column : 12
    <fa0>   DW_AT_type        : <0x160>
    <fa4>   DW_AT_data_member_location: 0
 <2><fa5>: Abbrev Number: 19 (DW_TAG_member)
    <fa6>   DW_AT_name        : (indirect string, offset: 0xe1793): SYSCLKSource
    <faa>   DW_AT_decl_file   : 9
    <fab>   DW_AT_decl_line   : 130
    <fac>   DW_AT_decl_column : 12
    <fad>   DW_AT_type        : <0x160>
    <fb1>   DW_AT_data_member_location: 4
 <2><fb2>: Abbrev Number: 19 (DW_TAG_member)
    <fb3>   DW_AT_name        : (indirect string, offset: 0xe2566): AHBCLKDivider
    <fb7>   DW_AT_decl_file   : 9
    <fb8>   DW_AT_decl_line   : 133
    <fb9>   DW_AT_decl_column : 12
    <fba>   DW_AT_type        : <0x160>
    <fbe>   DW_AT_data_member_location: 8
 <2><fbf>: Abbrev Number: 19 (DW_TAG_member)
    <fc0>   DW_AT_name        : (indirect string, offset: 0xdee90): APB1CLKDivider
    <fc4>   DW_AT_decl_file   : 9
    <fc5>   DW_AT_decl_line   : 136
    <fc6>   DW_AT_decl_column : 12
    <fc7>   DW_AT_type        : <0x160>
    <fcb>   DW_AT_data_member_location: 12
 <2><fcc>: Abbrev Number: 19 (DW_TAG_member)
    <fcd>   DW_AT_name        : (indirect string, offset: 0xe0b94): APB2CLKDivider
    <fd1>   DW_AT_decl_file   : 9
    <fd2>   DW_AT_decl_line   : 139
    <fd3>   DW_AT_decl_column : 12
    <fd4>   DW_AT_type        : <0x160>
    <fd8>   DW_AT_data_member_location: 16
 <2><fd9>: Abbrev Number: 0
 <1><fda>: Abbrev Number: 3 (DW_TAG_typedef)
    <fdb>   DW_AT_name        : (indirect string, offset: 0xe0320): RCC_ClkInitTypeDef
    <fdf>   DW_AT_decl_file   : 9
    <fe0>   DW_AT_decl_line   : 142
    <fe1>   DW_AT_decl_column : 2
    <fe2>   DW_AT_type        : <0xf8f>
 <1><fe6>: Abbrev Number: 17 (DW_TAG_structure_type)
    <fe7>   DW_AT_byte_size   : 20
    <fe8>   DW_AT_decl_file   : 10
    <fe9>   DW_AT_decl_line   : 46
    <fea>   DW_AT_decl_column : 9
    <feb>   DW_AT_sibling     : <0x1031>
 <2><fef>: Abbrev Number: 18 (DW_TAG_member)
    <ff0>   DW_AT_name        : Pin
    <ff4>   DW_AT_decl_file   : 10
    <ff5>   DW_AT_decl_line   : 48
    <ff6>   DW_AT_decl_column : 12
    <ff7>   DW_AT_type        : <0x160>
    <ffb>   DW_AT_data_member_location: 0
 <2><ffc>: Abbrev Number: 19 (DW_TAG_member)
    <ffd>   DW_AT_name        : (indirect string, offset: 0xe6fd5): Mode
    <1001>   DW_AT_decl_file   : 10
    <1002>   DW_AT_decl_line   : 51
    <1003>   DW_AT_decl_column : 12
    <1004>   DW_AT_type        : <0x160>
    <1008>   DW_AT_data_member_location: 4
 <2><1009>: Abbrev Number: 19 (DW_TAG_member)
    <100a>   DW_AT_name        : (indirect string, offset: 0xe0ec7): Pull
    <100e>   DW_AT_decl_file   : 10
    <100f>   DW_AT_decl_line   : 54
    <1010>   DW_AT_decl_column : 12
    <1011>   DW_AT_type        : <0x160>
    <1015>   DW_AT_data_member_location: 8
 <2><1016>: Abbrev Number: 19 (DW_TAG_member)
    <1017>   DW_AT_name        : (indirect string, offset: 0xe159c): Speed
    <101b>   DW_AT_decl_file   : 10
    <101c>   DW_AT_decl_line   : 57
    <101d>   DW_AT_decl_column : 12
    <101e>   DW_AT_type        : <0x160>
    <1022>   DW_AT_data_member_location: 12
 <2><1023>: Abbrev Number: 19 (DW_TAG_member)
    <1024>   DW_AT_name        : (indirect string, offset: 0xe0b8a): Alternate
    <1028>   DW_AT_decl_file   : 10
    <1029>   DW_AT_decl_line   : 60
    <102a>   DW_AT_decl_column : 12
    <102b>   DW_AT_type        : <0x160>
    <102f>   DW_AT_data_member_location: 16
 <2><1030>: Abbrev Number: 0
 <1><1031>: Abbrev Number: 3 (DW_TAG_typedef)
    <1032>   DW_AT_name        : (indirect string, offset: 0xe22b4): GPIO_InitTypeDef
    <1036>   DW_AT_decl_file   : 10
    <1037>   DW_AT_decl_line   : 62
    <1038>   DW_AT_decl_column : 3
    <1039>   DW_AT_type        : <0xfe6>
 <1><103d>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <103e>   DW_AT_encoding    : 7	(unsigned)
    <103f>   DW_AT_byte_size   : 1
    <1040>   DW_AT_type        : <0xe2>
    <1044>   DW_AT_decl_file   : 10
    <1045>   DW_AT_decl_line   : 68
    <1046>   DW_AT_decl_column : 1
    <1047>   DW_AT_sibling     : <0x1058>
 <2><104b>: Abbrev Number: 24 (DW_TAG_enumerator)
    <104c>   DW_AT_name        : (indirect string, offset: 0xdfac3): GPIO_PIN_RESET
    <1050>   DW_AT_const_value : 0
 <2><1051>: Abbrev Number: 24 (DW_TAG_enumerator)
    <1052>   DW_AT_name        : (indirect string, offset: 0xdfec2): GPIO_PIN_SET
    <1056>   DW_AT_const_value : 1
 <2><1057>: Abbrev Number: 0
 <1><1058>: Abbrev Number: 3 (DW_TAG_typedef)
    <1059>   DW_AT_name        : (indirect string, offset: 0xe310a): GPIO_PinState
    <105d>   DW_AT_decl_file   : 10
    <105e>   DW_AT_decl_line   : 71
    <105f>   DW_AT_decl_column : 3
    <1060>   DW_AT_type        : <0x103d>
 <1><1064>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1065>   DW_AT_byte_size   : 32
    <1066>   DW_AT_decl_file   : 11
    <1067>   DW_AT_decl_line   : 46
    <1068>   DW_AT_decl_column : 9
    <1069>   DW_AT_sibling     : <0x10d6>
 <2><106d>: Abbrev Number: 19 (DW_TAG_member)
    <106e>   DW_AT_name        : (indirect string, offset: 0xe66ce): Request
    <1072>   DW_AT_decl_file   : 11
    <1073>   DW_AT_decl_line   : 48
    <1074>   DW_AT_decl_column : 12
    <1075>   DW_AT_type        : <0x160>
    <1079>   DW_AT_data_member_location: 0
 <2><107a>: Abbrev Number: 19 (DW_TAG_member)
    <107b>   DW_AT_name        : (indirect string, offset: 0xe78e5): Direction
    <107f>   DW_AT_decl_file   : 11
    <1080>   DW_AT_decl_line   : 51
    <1081>   DW_AT_decl_column : 12
    <1082>   DW_AT_type        : <0x160>
    <1086>   DW_AT_data_member_location: 4
 <2><1087>: Abbrev Number: 19 (DW_TAG_member)
    <1088>   DW_AT_name        : (indirect string, offset: 0xdf009): PeriphInc
    <108c>   DW_AT_decl_file   : 11
    <108d>   DW_AT_decl_line   : 55
    <108e>   DW_AT_decl_column : 12
    <108f>   DW_AT_type        : <0x160>
    <1093>   DW_AT_data_member_location: 8
 <2><1094>: Abbrev Number: 19 (DW_TAG_member)
    <1095>   DW_AT_name        : (indirect string, offset: 0xdf504): MemInc
    <1099>   DW_AT_decl_file   : 11
    <109a>   DW_AT_decl_line   : 58
    <109b>   DW_AT_decl_column : 12
    <109c>   DW_AT_type        : <0x160>
    <10a0>   DW_AT_data_member_location: 12
 <2><10a1>: Abbrev Number: 19 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0xe0df8): PeriphDataAlignment
    <10a6>   DW_AT_decl_file   : 11
    <10a7>   DW_AT_decl_line   : 61
    <10a8>   DW_AT_decl_column : 12
    <10a9>   DW_AT_type        : <0x160>
    <10ad>   DW_AT_data_member_location: 16
 <2><10ae>: Abbrev Number: 19 (DW_TAG_member)
    <10af>   DW_AT_name        : (indirect string, offset: 0xe2c02): MemDataAlignment
    <10b3>   DW_AT_decl_file   : 11
    <10b4>   DW_AT_decl_line   : 64
    <10b5>   DW_AT_decl_column : 12
    <10b6>   DW_AT_type        : <0x160>
    <10ba>   DW_AT_data_member_location: 20
 <2><10bb>: Abbrev Number: 19 (DW_TAG_member)
    <10bc>   DW_AT_name        : (indirect string, offset: 0xe6fd5): Mode
    <10c0>   DW_AT_decl_file   : 11
    <10c1>   DW_AT_decl_line   : 67
    <10c2>   DW_AT_decl_column : 12
    <10c3>   DW_AT_type        : <0x160>
    <10c7>   DW_AT_data_member_location: 24
 <2><10c8>: Abbrev Number: 19 (DW_TAG_member)
    <10c9>   DW_AT_name        : (indirect string, offset: 0xe6973): Priority
    <10cd>   DW_AT_decl_file   : 11
    <10ce>   DW_AT_decl_line   : 72
    <10cf>   DW_AT_decl_column : 12
    <10d0>   DW_AT_type        : <0x160>
    <10d4>   DW_AT_data_member_location: 28
 <2><10d5>: Abbrev Number: 0
 <1><10d6>: Abbrev Number: 3 (DW_TAG_typedef)
    <10d7>   DW_AT_name        : (indirect string, offset: 0xdffbe): DMA_InitTypeDef
    <10db>   DW_AT_decl_file   : 11
    <10dc>   DW_AT_decl_line   : 74
    <10dd>   DW_AT_decl_column : 3
    <10de>   DW_AT_type        : <0x1064>
 <1><10e2>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <10e3>   DW_AT_encoding    : 7	(unsigned)
    <10e4>   DW_AT_byte_size   : 1
    <10e5>   DW_AT_type        : <0xe2>
    <10e9>   DW_AT_decl_file   : 11
    <10ea>   DW_AT_decl_line   : 80
    <10eb>   DW_AT_decl_column : 1
    <10ec>   DW_AT_sibling     : <0x1109>
 <2><10f0>: Abbrev Number: 24 (DW_TAG_enumerator)
    <10f1>   DW_AT_name        : (indirect string, offset: 0xe2020): HAL_DMA_STATE_RESET
    <10f5>   DW_AT_const_value : 0
 <2><10f6>: Abbrev Number: 24 (DW_TAG_enumerator)
    <10f7>   DW_AT_name        : (indirect string, offset: 0xe000b): HAL_DMA_STATE_READY
    <10fb>   DW_AT_const_value : 1
 <2><10fc>: Abbrev Number: 24 (DW_TAG_enumerator)
    <10fd>   DW_AT_name        : (indirect string, offset: 0xe1d77): HAL_DMA_STATE_BUSY
    <1101>   DW_AT_const_value : 2
 <2><1102>: Abbrev Number: 24 (DW_TAG_enumerator)
    <1103>   DW_AT_name        : (indirect string, offset: 0xe3118): HAL_DMA_STATE_TIMEOUT
    <1107>   DW_AT_const_value : 3
 <2><1108>: Abbrev Number: 0
 <1><1109>: Abbrev Number: 3 (DW_TAG_typedef)
    <110a>   DW_AT_name        : (indirect string, offset: 0xe1c05): HAL_DMA_StateTypeDef
    <110e>   DW_AT_decl_file   : 11
    <110f>   DW_AT_decl_line   : 85
    <1110>   DW_AT_decl_column : 2
    <1111>   DW_AT_type        : <0x10e2>
 <1><1115>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1116>   DW_AT_type        : <0x1109>
 <1><111a>: Abbrev Number: 25 (DW_TAG_structure_type)
    <111b>   DW_AT_name        : (indirect string, offset: 0xe28aa): __DMA_HandleTypeDef
    <111f>   DW_AT_byte_size   : 72
    <1120>   DW_AT_decl_file   : 11
    <1121>   DW_AT_decl_line   : 112
    <1122>   DW_AT_decl_column : 16
    <1123>   DW_AT_sibling     : <0x11c4>
 <2><1127>: Abbrev Number: 19 (DW_TAG_member)
    <1128>   DW_AT_name        : (indirect string, offset: 0xe24b7): Instance
    <112c>   DW_AT_decl_file   : 11
    <112d>   DW_AT_decl_line   : 114
    <112e>   DW_AT_decl_column : 27
    <112f>   DW_AT_type        : <0x11c4>
    <1133>   DW_AT_data_member_location: 0
 <2><1134>: Abbrev Number: 19 (DW_TAG_member)
    <1135>   DW_AT_name        : (indirect string, offset: 0xe78d7): Init
    <1139>   DW_AT_decl_file   : 11
    <113a>   DW_AT_decl_line   : 116
    <113b>   DW_AT_decl_column : 25
    <113c>   DW_AT_type        : <0x10d6>
    <1140>   DW_AT_data_member_location: 4
 <2><1141>: Abbrev Number: 19 (DW_TAG_member)
    <1142>   DW_AT_name        : (indirect string, offset: 0x9dafa): Lock
    <1146>   DW_AT_decl_file   : 11
    <1147>   DW_AT_decl_line   : 118
    <1148>   DW_AT_decl_column : 25
    <1149>   DW_AT_type        : <0xe6d>
    <114d>   DW_AT_data_member_location: 36
 <2><114e>: Abbrev Number: 19 (DW_TAG_member)
    <114f>   DW_AT_name        : (indirect string, offset: 0xe07a8): State
    <1153>   DW_AT_decl_file   : 11
    <1154>   DW_AT_decl_line   : 120
    <1155>   DW_AT_decl_column : 30
    <1156>   DW_AT_type        : <0x1115>
    <115a>   DW_AT_data_member_location: 37
 <2><115b>: Abbrev Number: 19 (DW_TAG_member)
    <115c>   DW_AT_name        : (indirect string, offset: 0xe0366): Parent
    <1160>   DW_AT_decl_file   : 11
    <1161>   DW_AT_decl_line   : 122
    <1162>   DW_AT_decl_column : 26
    <1163>   DW_AT_type        : <0x11ca>
    <1167>   DW_AT_data_member_location: 40
 <2><1168>: Abbrev Number: 19 (DW_TAG_member)
    <1169>   DW_AT_name        : (indirect string, offset: 0xe31d6): XferCpltCallback
    <116d>   DW_AT_decl_file   : 11
    <116e>   DW_AT_decl_line   : 124
    <116f>   DW_AT_decl_column : 28
    <1170>   DW_AT_type        : <0x11dd>
    <1174>   DW_AT_data_member_location: 44
 <2><1175>: Abbrev Number: 19 (DW_TAG_member)
    <1176>   DW_AT_name        : (indirect string, offset: 0xe2257): XferHalfCpltCallback
    <117a>   DW_AT_decl_file   : 11
    <117b>   DW_AT_decl_line   : 126
    <117c>   DW_AT_decl_column : 28
    <117d>   DW_AT_type        : <0x11dd>
    <1181>   DW_AT_data_member_location: 48
 <2><1182>: Abbrev Number: 19 (DW_TAG_member)
    <1183>   DW_AT_name        : (indirect string, offset: 0xdf3c1): XferErrorCallback
    <1187>   DW_AT_decl_file   : 11
    <1188>   DW_AT_decl_line   : 128
    <1189>   DW_AT_decl_column : 28
    <118a>   DW_AT_type        : <0x11dd>
    <118e>   DW_AT_data_member_location: 52
 <2><118f>: Abbrev Number: 19 (DW_TAG_member)
    <1190>   DW_AT_name        : (indirect string, offset: 0xe2d87): XferAbortCallback
    <1194>   DW_AT_decl_file   : 11
    <1195>   DW_AT_decl_line   : 130
    <1196>   DW_AT_decl_column : 28
    <1197>   DW_AT_type        : <0x11dd>
    <119b>   DW_AT_data_member_location: 56
 <2><119c>: Abbrev Number: 19 (DW_TAG_member)
    <119d>   DW_AT_name        : (indirect string, offset: 0xe30d1): ErrorCode
    <11a1>   DW_AT_decl_file   : 11
    <11a2>   DW_AT_decl_line   : 132
    <11a3>   DW_AT_decl_column : 25
    <11a4>   DW_AT_type        : <0x16c>
    <11a8>   DW_AT_data_member_location: 60
 <2><11a9>: Abbrev Number: 19 (DW_TAG_member)
    <11aa>   DW_AT_name        : (indirect string, offset: 0xe082f): DmaBaseAddress
    <11ae>   DW_AT_decl_file   : 11
    <11af>   DW_AT_decl_line   : 134
    <11b0>   DW_AT_decl_column : 26
    <11b1>   DW_AT_type        : <0x11e3>
    <11b5>   DW_AT_data_member_location: 64
 <2><11b6>: Abbrev Number: 19 (DW_TAG_member)
    <11b7>   DW_AT_name        : (indirect string, offset: 0xdeffc): ChannelIndex
    <11bb>   DW_AT_decl_file   : 11
    <11bc>   DW_AT_decl_line   : 136
    <11bd>   DW_AT_decl_column : 25
    <11be>   DW_AT_type        : <0x160>
    <11c2>   DW_AT_data_member_location: 68
 <2><11c3>: Abbrev Number: 0
 <1><11c4>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <11c5>   DW_AT_byte_size   : 4
    <11c6>   DW_AT_type        : <0x851>
 <1><11ca>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <11cb>   DW_AT_byte_size   : 4
 <1><11cc>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <11cd>   DW_AT_prototyped  : 1
    <11cd>   DW_AT_sibling     : <0x11d7>
 <2><11d1>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <11d2>   DW_AT_type        : <0x11d7>
 <2><11d6>: Abbrev Number: 0
 <1><11d7>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <11d8>   DW_AT_byte_size   : 4
    <11d9>   DW_AT_type        : <0x111a>
 <1><11dd>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <11de>   DW_AT_byte_size   : 4
    <11df>   DW_AT_type        : <0x11cc>
 <1><11e3>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <11e4>   DW_AT_byte_size   : 4
    <11e5>   DW_AT_type        : <0x885>
 <1><11e9>: Abbrev Number: 3 (DW_TAG_typedef)
    <11ea>   DW_AT_name        : (indirect string, offset: 0xe28ac): DMA_HandleTypeDef
    <11ee>   DW_AT_decl_file   : 11
    <11ef>   DW_AT_decl_line   : 153
    <11f0>   DW_AT_decl_column : 2
    <11f1>   DW_AT_type        : <0x111a>
 <1><11f5>: Abbrev Number: 17 (DW_TAG_structure_type)
    <11f6>   DW_AT_byte_size   : 16
    <11f7>   DW_AT_decl_file   : 12
    <11f8>   DW_AT_decl_line   : 49
    <11f9>   DW_AT_decl_column : 9
    <11fa>   DW_AT_sibling     : <0x1233>
 <2><11fe>: Abbrev Number: 19 (DW_TAG_member)
    <11ff>   DW_AT_name        : (indirect string, offset: 0xe145e): Ratio
    <1203>   DW_AT_decl_file   : 12
    <1204>   DW_AT_decl_line   : 51
    <1205>   DW_AT_decl_column : 12
    <1206>   DW_AT_type        : <0x160>
    <120a>   DW_AT_data_member_location: 0
 <2><120b>: Abbrev Number: 19 (DW_TAG_member)
    <120c>   DW_AT_name        : (indirect string, offset: 0xe11f7): RightBitShift
    <1210>   DW_AT_decl_file   : 12
    <1211>   DW_AT_decl_line   : 54
    <1212>   DW_AT_decl_column : 12
    <1213>   DW_AT_type        : <0x160>
    <1217>   DW_AT_data_member_location: 4
 <2><1218>: Abbrev Number: 19 (DW_TAG_member)
